<?php include("top.php");?>
<?php include("nav.php");?>
<div class="hide-for-large" id="mobile-support"></div>
<div id="first-row" class="row">
    <div class="small-12 columns">
        <h1>Επεξεργαστές Κειμένου Προγραμματισμού</h1>
        <p>
            Θα χρειαστείτε ένα πρόγραμμα επεξεργασίας κειμένου, το οποίο θα
            χρησιμοποιήσετε για τη σύνταξη των προγραμμάτων σας. Συγκεκριμένα,
            υπάρχει ένα σύνολο προγραμμάτων επεξεργασίας που δεν πρέπει να
            χρησιμοποιείτε για προγραμματισμό, συμπεριλαμβανομένων των
            Microsoft Word, NotePad, TextEdit ή Libre Office. Αυτοί οι
            επεξεργαστές τείνουν να μην αποθηκεύουν "απλό κείμενο", που είναι ο
            τρόπος με τον οποίο πρέπει να γράφουμε προγράμματα. Τα προγράμματα
            δεν μπορούν να έχουν έντονους χαρακτήρες, πλάγιους χαρακτήρες ή
            διαφορετικές γραμματοσειρές - και ακόμα κι αν δεν χρησιμοποιείτε
            αυτές τις μορφοποιήσεις στο αρχείο σας, τα αρχεία αυτών των
            προγραμμάτων αποθηκεύονται σε μια μορφή που μπορεί να περιέχει
            τέτοιες μορφοποιήσεις, σχετικές με όλο αυτό το "όμορφο" κείμενο -
            και αυτό προκαλεί σύγχυση στους μεταγλωττιστές και διερμηνείς.
        </p>
        <p>
            Εάν έχετε ήδη εγκατεστημένο κάποιο πρόγραμμα επεξεργασίας κειμένου
            κατάλληλο για προγραμματισμό ή κάποιο περιβάλλον ανάπτυξης,
            συνεχίστε να το χρησιμοποιείτε. Δεν χρειάζεται να εγκαταστήσετε
            άλλο πρόγραμμα επεξεργασίας μόνο για αυτό το μάθημα.
        </p>
        <h2>Προτεινόμενοw Επεξεργαστής Κειμένου Προγραμματισμού: Brackets.IO</h2>
        <p>
            Εάν πρόκειται να εγκαταστήσετε τον πρώτο σας πρόγραμμα επεξεργασίας
            προγραμματισμού, σας συνιστούμε να προτιμήσετε κάτι απλό και να
            χρησιμοποιήσετε το
            <a href="https://brackets.io/" target="_blank">brackets.io</a> - είναι
            δωρεάν, ανοιχτού κώδικα και λειτουργεί σε Windows, Linux και Macintosh.
        </p>
        <h2>Εναλλακτικοί Επεξεργαστής Κειμένου Προγραμματισμού</h2>
        <p>
            Υπάρχουν πιο εξελιγμένα προγράμματα επεξεργασίας κειμένου και ενσωματωμένα
            περιβάλλοντα ανάπτυξης διαθέσιμα. Αυτά είναι συχνά πιο περίπλοκα στην
            εγκατάσταση - αλλά μπορούν να βελτιώσουν σημαντικά την παραγωγικότητά σας.
        </p>
        <ul>
            <li>
                <a href="https://code.visualstudio.com/" target="_blank">Ο VSCode programmer text editor</a> 
            </li>
            <li>
                <a href="https://www.jetbrains.com/pycharm/" target="_blank">PyCharm</a>
                    διαδραστικό περιβάλλον ανάπτυξης (IDE) [Σημείωση: <b>πρέπει</b> να κάντε αίτηση στο JetBrain's για δωρεάν <a href="https://www.jetbrains.com/student/">student license (φοιτητική άδεια)</a>]
            </li>
            <li>
                <a href="http://www.sublimetext.com/" target="_blank">Sublime programmer text editor</a>
            </li>
        </ul>
        <p>
        Μπορείτε να χρησιμοποιήσετε οποιοδήποτε πρόγραμμα επεξεργασίας προγραμματισμού θέλετε για αυτό το μάθημα
        </p>

    </div>
</div>
<?php include("footer.php"); ?>
