<?php include("top.php");?>
<?php include("nav.php");?>
        <h2>Πολιτική απορρήτου</h2>
<p>
        Αυτή η πολιτική απορρήτου έχει συνταχθεί για να εξυπηρετεί καλύτερα εκείνους που ενδιαφέρονται για το πώς χρησιμοποιούνται οι «Προσωπικά αναγνωρίσιμες πληροφορίες» 
        τους (PII) στο διαδίκτυο. Το PII, όπως περιγράφεται στη νομοθεσία περί απορρήτου των ΗΠΑ και την ασφάλεια των πληροφοριών, είναι πληροφορίες που μπορούν να 
        χρησιμοποιηθούν από μόνα τους ή με άλλες πληροφορίες για την αναγνώριση, την επαφή ή τον εντοπισμό ενός ατόμου ή τον προσδιορισμό ενός ατόμου σε αυτό το πλαίσιο. 
        Διαβάστε προσεκτικά την πολιτική απορρήτου μας για να κατανοήσετε τον τρόπο με τον οποίο συλλέγουμε, χρησιμοποιούμε, προστατεύουμε ή με άλλο τρόπο χειριζόμαστε τις
        Προσωπικές σας Πληροφορίες σύμφωνα με τον ιστότοπό μας.
</p>
<p><strong>Ποιες προσωπικές πληροφορίες συλλέγουμε από τα άτομα που επισκέπτονται το ιστολόγιο(blog), τον ιστότοπο ή την εφαρμογή μας;</strong></p>
<p>
        Κατά την παραγγελία ή την εγγραφή στον ιστότοπό μας, ανάλογα με την περίπτωση, μπορεί να σας ζητηθεί να εισαγάγετε το όνομά σας, τη διεύθυνση ηλεκτρονικού ταχυδρομείου ή άλλες
        λεπτομέρειες για να σας βοηθήσουμε με την εμπειρία σας.
</p>
<p><strong>Πότε συλλέγουμε πληροφορίες;</strong></p>
<p>
        Ενδέχεται να χρησιμοποιήσουμε τις πληροφορίες που συλλέγουμε από εσάς όταν γίνει η καταγραφή σας, εγγραφείτε στο ενημερωτικό μας δελτίο, απαντήσετε σε έρευνα ή 
        επικοινωνία μάρκετινγκ, περιηγηθείτε στον ιστότοπο ή χρησιμοποιήσετε ορισμένες άλλες λειτουργίες του ιστότοπου.
</p>
<p><strong>Πώς προστατεύουμε τις πληροφορίες σας;</strong></p>
<p>
        Τα προσωπικά σας στοιχεία βρίσκονται πίσω από ασφαλή δίκτυα και είναι προσβάσιμα μόνο από περιορισμένο αριθμό ατόμων που έχουν ειδικά δικαιώματα πρόσβασης σε τέτοια 
        συστήματα και είναι υποχρεωμένα να διατηρούν εμπιστευτικές τις πληροφορίες. Επιπλέον, όλες οι ευαίσθητες/πιστωτικές πληροφορίες που παρέχετε είναι κρυπτογραφημένες μέσω
        της τεχνολογίας Secure Socket Layer (SSL).
</p>
<p><strong>Χρησιμοποιούμε «cookies»;</strong></p>
<p>
        Ναί. Τα cookie είναι μικρά αρχεία που ένας ιστότοπος ή ο πάροχος υπηρεσιών του μεταφέρει στον σκληρό δίσκο του υπολογιστή σας μέσω του προγράμματος περιήγησής σας στο
        Web (εάν το επιτρέπετε), που επιτρέπει στα συστήματα του ιστότοπου ή του παρόχου υπηρεσιών να αναγνωρίζουν το πρόγραμμα περιήγησής σας και να καταγράφουν και να 
        θυμούνται ορισμένες πληροφορίες.
</p>
<p><strong>Χρησιμοποιούμε cookies για:</strong></p>
<p>Κατανόηση και αποθήκευση των προτιμήσεων και της αναγνώριση της ταυτότητας του χρήστη σε μελλοντικές επισκέψεις.</p>
<p>Συλλογή δεδομένων ανάλυσης που χρησιμοποιούνται μόνο για την παρακολούθηση και τη βελτίωση του ιστότοπου.</p>
<p><strong>Εάν οι χρήστες απενεργοποιήσουν τα cookie στο πρόγραμμα περιήγησής τους:</strong></p>
<p>Εάν απενεργοποιήσετε τα cookie, δεν θα μπορείτε να συνδεθείτε απευθείας στον ιστότοπο.</p>
<p>
        <b>Μπορείτε</b> να χρησιμοποιήσετε τα εργαλεία εκμάθησης σε αυτό το σύστημα όταν εκκινείτε από ένα LMS με απενεργοποιημένα τα cookies, αφού οι εφαρμογές εκμάθησης 
        <i> ούτε χρησιμοποιούν, ούτε απαιτούν cookie </i> και θα έχουν λητουργούν πλήρως ακόμη και όταν τα cookie είναι απενεργοποιημένα.
</p>
<p><strong>Γνωστοποίηση σε τρίτους</strong></p>
<p>Δεν πουλάμε, δεν εμπορευόμαστε ή δεν μεταβιβάζουμε με άλλον τρόπο τις Προσωπικές σας Πληροφορίες σε τρίτους.</p>

<p><strong>Σύνδεσμοι τρίτων</strong></p>
<p>Δεν συμπεριλαμβάνουμε ή προσφέρουμε προϊόντα ή υπηρεσίες τρίτων μερών στον ιστότοπό μας.</p>

<p><strong>Διαφήμιση</strong></p>
<p>Δεν κάνουμε διαφήμιση τρίτων σε αυτόν τον ιστότοπο.</p>

<p><strong>Google Analytics</strong></p>
<?php if ( isset($CFG->universal_analytics) && $CFG->universal_analytics ) { ?>
        <p>
                Χρησιμοποιούμε το Google analytics για την παρακολούθηση της χρήσης και τη βελτίωση του ιστότοπου, εκτός εάν ζητήσετε να μην παρακολουθήσται χρησιμοποιώντας το 
                σήμα Do Not Track (δείτε παρακάτω).
        </p>
        <p>
                Η Google, ως τρίτος προμηθευτής, χρησιμοποιεί cookie για την υποστήριξη αναλυτικών στοιχείων στον ιστότοπό μας. Οι χρήστες μπορούν να εξαιρεθούν από τη χρήση του 
                cookie DART χρησιμοποιώντας τις δυνατότητες εξαίρεσης που παρέχονται από την Google. Εάν οι χρήστες εξαιρεθούν από το Google Analytics σε αυτόν τον ιστότοπο, 
                δεν υπάρχει μείωση στη λειτουργικότητα αυτού του ιστότοπου.
        </p>
<?php } else { ?>
        <p>Δεν χρησιμοποιούμε Google Analytics σε αυτόν τον ιστότοπο.</p>
<?php } ?>
<?php if ( isset($CFG->google_translate) && $CFG->google_translate ) { ?>
        <p><strong>Μετάφραση Google</strong></p>
        <p>
                Χρησιμοποιούμε τη Μετάφραση Google σε αυτόν τον ιστότοπο, εκτός εάν ζητήσετε να μην παρακολουθήσται χρησιμοποιώντας το σήμα "Μην παρακολουθείτε/Do Not Track" 
                (δείτε παρακάτω).
        </p>
<?php } ?>
<?php if ( isset($CFG->google_map_api_key) && $CFG->google_map_api_key ) { ?>
        <p><strong>Χάρτες Google</strong></p>
        <p>Ορισμένες σελίδες σε αυτόν τον ιστότοπο ενδέχεται να χρησιμοποιούν τους Χάρτες Google.</p>
<?php } ?>

<p><strong>Πώς χειρίζεται ο ιστότοπός μας σήματα Do Not Track;</strong></p>
<p>Τιμούμε τα σήματα Do Not Track. Όταν υποδεικνύεται το DMT, καταστέλλουμε τη συλλογή όλων των εσωτερικών δεδομένων ανάλυσης.</p>

<p><strong>COPPA (Children Online Privacy Protection Act)</strong></p>
<p>Δεν εμπορευόμαστε, ειδικά σε παιδιά κάτω των 13 ετών.</p>

<p><strong>Διατήρηση Δεδομένων</strong></p>
<p>
        Λήγουμε ενεργά τα ανενεργά δεδομένα με βάση ένα χρονοδιάγραμμα. Όταν τα δεδομένα λήγουν ή αφαιρούνται με μη αυτόματο τρόπο, αυτή η υπηρεσία δεν διατηρεί αντίγραφο 
        των δεδομένων. Διατηρώντας μόνο ενεργά δεδομένα στο σύστημα, μειώνουμε τη συνολική ποσότητα «Προσωπικά αναγνωρίσιμων πληροφοριών» (PII) στο σύστημα ανά πάσα στιγμή.
</p>
<p><strong>Ανάλυση δεδομένων</strong></p>
<p>
        Περιορίζουμε την ανάλυση των δεδομένων PII σε αναφορές που ζητούνται από τον πελάτη ή αναφορές που είναι απαραίτητες για τη λογιστική, την τεχνική υποστήριξη και τα συνολικά 
        στατιστικά στοιχεία του συστήματος. Ενδέχεται να κάνουμε εσωτερική ανάλυση δεδομένων για να βελτιώσουμε την τεχνική αξιοπιστία, τη λειτουργικότητα ή την απόδοση του συστήματος.
        Συγκεκριμένα, <b> δεν </b> θα χρησιμοποιήσουμε τεχνικές μηχανικής μάθησης ή Τεχνητής Νοημοσύνης για να κατανοήσουμε τη συμπεριφορά όσων χρησιμοποιούν τον ιστότοπό μας.
</p>
<p><strong>Γενική Φιλοσοφία</strong></p>
<p>
        Συχνά λέγεται ότι εάν δεν πληρώνετε για μια υπηρεσία, τότε είστε το προϊόν. Για αυτήν την υπηρεσία, δεν είστε το προϊόν και τα δεδομένα/δραστηριότητά σας δεν είναι το 
        προϊόν. Διατηρούμε μόνο όσα δεδομένα χρειάζεστε για την επίτευξη των διδακτικών και μαθησιακών σας στόχων και για κανέναν άλλο σκοπό. Όπου είναι δυνατόν, σας δίνουμε 
        τον έλεγχο της διατήρησης των δεδομένων σας και σεβόμαστε τις επιθυμίες σας όσον αφορά τη διατήρηση των δεδομένων σας.
</p>
<p>
        Στόχος μας είναι να συμμορφωθούμε τόσο με τα γράμματα όσο και με το πνεύμα των νόμων περί απορρήτου, όπως ο νόμος περί The Family Educational Rights and Privacy Act
        (FERPA) και οι κανονισμοί της ΕΕ για τον Γενικό Κανονισμό Προστασίας Δεδομένων / General Data Protection Regulation (GDPR). Στόχος μας είναι να δεσμευτούμε για την 
        προστασία της ιδιωτικής ζωής των μαθητών που υπερβαίνει τις ελάχιστες απαιτήσεις αυτών των νόμων.
</p>
<p>
        Μεγάλο μέρος του λογισμικού που χρησιμοποιείται σε αυτήν την εταιρεία είναι ανοιχτού κώδικα, ώστε να μπορείτε να εξετάσετε/ελέγξετε τι κάνουμε σε σχέση με την ιδιωτική
        ζωή και ενδεχομένως να μας βοηθήσετε να βελτιώσουμε τις προσεγγίσεις μας σε αυτό το πολύ σημαντικό θέμα.
</p>
<p><strong>Ειδοποιήσεις</strong> </p>
<p>Για να είμαστε σύμφωνοι με τις Δίκαιες Πρακτικές Πληροφόρησης, θα λάβουμε τις ακόλουθες απαντητικές ενέργειες, εάν προκύψει παραβίαση δεδομένων: Θα σας ενημερώσουμε μέσω email</p>
<p>Εάν υπάρχουν ερωτήσεις σχετικά με αυτήν την πολιτική απορρήτου, μπορείτε να επικοινωνήσετε μαζί μας χρησιμοποιώντας τις παρακάτω πληροφορίες.<br></p>
<pre><code>Python για Όλους (gr.py4e.com)
c/o Learning Experiences (learnxp.com)
2190 Aurelius Rd. Unit 175
Holt MI 48842-9998
United States</code></pre>
<p>Last edited: 22-Nov-2020</p>
<?php include("footer.php"); ?>

