<?php include("top.php");?>
<?php include("nav.php");?>
        <h2>Όροι χρήσης</h2>
<p>
        Αυτή είναι μια εξαιρετικά αξιόπιστη, κλιμακούμενη και ασφαλής υπηρεσία που βασίζεται στο cloud, αλλά ενδέχεται να προκύψουν διακοπές. Αλλά δεδομένου ότι δεν υπάρχουν
        χρεώσεις για αυτήν την υπηρεσία, δεν υπάρχει επίσημη συμφωνία επιπέδου υπηρεσιών για αυτήν την. Εάν αντιμετωπίζετε προβλήματα με την απόδοση ή την αξιοπιστία αυτού του
        ιστότοπου, επικοινωνήστε μαζί μας. 
</p>
<p> 
        Αυτός ο ιστότοπος ενδιαφέρεται πολύ για την προστασία όσων χρησιμοποιούν αυτούς τους διακομιστές. Ανατρέξτε στην <a href="privacy"> Πολιτική απορρήτου </a> για 
        περισσότερες λεπτομέρειες.
</p>
<p><strong>Ειδοποιήσεις</strong> </p>
<p>
        Για να είμαστε σύμφωνοι με τις Δίκαιες Πρακτικές Πληροφόρησης, θα λάβουμε τις ακόλουθες απαντητικές ενέργειες, εάν προκύψει παραβίαση δεδομένων: Θα σας ενημερώσουμε μέσω email
</p>
<pre><code>Python για Όλους (gr.py4e.com)
c/o Learning Experiences (learnxp.com)
2190 Aurelius Rd. Unit 175
Holt MI 48842-9998
United States</code></pre>
<p>Last edited: 22-Nov-2020</p>
<?php include("footer.php"); ?>

