<?php if ( file_exists("../booktop.php") ) {
  require_once "../booktop.php";
  ob_start();
}?>
<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" lang="" xml:lang="">
<head>
  <meta charset="utf-8" />
  <meta name="generator" content="pandoc" />
  <meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes" />
  <title>Untitled</title>
  <style type="text/css">
      code{white-space: pre-wrap;}
      span.smallcaps{font-variant: small-caps;}
      span.underline{text-decoration: underline;}
      div.column{display: inline-block; vertical-align: top; width: 50%;}
  </style>
</head>
<body>
<h1 id="χρήση-βάσεων-δεδομένων-και-sql">Χρήση Βάσεων Δεδομένων και SQL</h1>
<h2 id="τι-είναι-μια-βάση-δεδομένων">Τι είναι μια βάση δεδομένων;</h2>
<p></p>
<p>Μια <em>βάση δεδομένων</em> είναι ένα αρχείο που είναι οργανωμένο για την αποθήκευση δεδομένων. Οι περισσότερες βάσεις δεδομένων είναι οργανωμένες σαν λεξικό, με την έννοια ότι υπάρχει αντιστοίχιση ανάμεσα σε κλειδιά και τιμές. Η μεγαλύτερη διαφορά είναι ότι η βάση δεδομένων βρίσκεται στο δίσκο (ή σε άλλη μονάδα μόνιμης αποθήκευσης), επομένως παραμένει και μετά το τέλος του προγράμματος. Επειδή μια βάση δεδομένων αποθηκεύεται σε μονάδα μόνιμης αποθήκευσης, μπορεί να αποθηκεύσει πολύ περισσότερα δεδομένα από ένα λεξικό, το οποίο περιορίζεται στο μέγεθος της μνήμης στον υπολογιστή.</p>
<p></p>
<p>Όπως ένα λεξικό, το λογισμικό βάσης δεδομένων έχει σχεδιαστεί για να παρέχει πολύ γρήγορη εισαγωγή και πρόσβαση στα δεδομένα, ακόμη και για μεγάλες ποσότητες δεδομένων. Το λογισμικό βάσης δεδομένων διατηρεί την απόδοσή του δημιουργώντας <em>ευρετήρια</em>, καθώς τα δεδομένα προστίθενται στη βάση δεδομένων, για να επιτρέψουν στον υπολογιστή την γρήγορη προσπέλαση μιας συγκεκριμένης καταχώρησης.</p>
<p>Υπάρχουν πολλά διαφορετικά συστήματα βάσεων δεδομένων, που χρησιμοποιούνται για μια μεγάλη ποικιλία σκοπών, όπως: Oracle, MySQL, Microsoft SQL Server, PostgreSQL και SQLite. Εστιάζουμε στο SQLite, σε αυτό το βιβλίο, επειδή είναι μια πολύ κοινή βάση δεδομένων και είναι ήδη ενσωματωμένη στην Python. Το SQLite έχει σχεδιαστεί για να <em>ενσωματώνεται</em> σε άλλες εφαρμογές και να παρέχει υποστήριξη βάσης δεδομένων εντός της εφαρμογής. Για παράδειγμα, το πρόγραμμα περιήγησης Firefox χρησιμοποιεί, κι αυτό, τη βάση δεδομένων SQLite, εσωτερικά, όπως και πολλά άλλα προϊόντα.</p>
<p><a href="http://sqlite.org/" class="uri">http://sqlite.org/</a></p>
<p>Το SQLite είναι κατάλληλο για ορισμένα από τα προβλήματα χειρισμού δεδομένων, που βλέπουμε στην Πληροφορική, όπως η εφαρμογή ιστοσυγκομιδής του Twitter, που περιγράφουμε σε αυτό το κεφάλαιο.</p>
<h2 id="έννοιες-βάσης-δεδομένων">Έννοιες βάσης δεδομένων</h2>
<p>Όταν κοιτάζετε για πρώτη φορά μια βάση δεδομένων, μοιάζει με υπολογιστικό φύλλο με πολλά φύλλα. Οι κύριες δομές δεδομένων σε μια βάση δεδομένων είναι: <em>πίνακες</em>, <em>γραμμές</em> και <em>στήλες</em>.</p>
<figure>
<img src="../images/relational.svg" alt="Σχεσιακές βάσεις δεδομένων" style="height: 2.0in;"/>
<figcaption>
Σχεσιακές βάσεις δεδομένων
</figcaption>
</figure>
<p>Στις τεχνικές περιγραφές των σχεσιακών βάσεων δεδομένων, οι έννοιες του πίνακα, της γραμμής και της στήλης αναφέρονται και ως <em>σχέση</em>, <em>εγγραφή</em> και <em>χαρακτηριστικό</em>, αντίστοιχα. Θα χρησιμοποιήσουμε τους λιγότερο επίσημους όρους σε αυτό το κεφάλαιο.</p>
<h2 id="πρόγραμμα-περιήγησης-βάσεων-δεδομένων-για-sqlite">Πρόγραμμα περιήγησης βάσεων δεδομένων για SQLite</h2>
<p>Ενώ αυτό το κεφάλαιο θα επικεντρωθεί στη χρήση της Python για εργασία με δεδομένα σε αρχεία βάσης δεδομένων SQLite, πολλές λειτουργίες μπορούν να γίνουν πιο βολικά χρησιμοποιώντας το λογισμικό που ονομάζεται <em>Database Browser for SQLite (Πρόγραμμα περιήγησης βάσης δεδομένων για SQLite)</em> το οποίο διατίθεται δωρεάν από:</p>
<p><a href="http://sqlitebrowser.org/" class="uri">http://sqlitebrowser.org/</a></p>
<p>Χρησιμοποιώντας το πρόγραμμα περιήγησης μπορείτε εύκολα να δημιουργήσετε πίνακες, να εισαγάγετε δεδομένα, να επεξεργαστείτε δεδομένα ή να εκτελέσετε απλά ερωτήματα SQL στα δεδομένα της βάσης δεδομένων.</p>
<p>Κατά μία έννοια, το πρόγραμμα περιήγησης της βάσης δεδομένων είναι παρόμοιο με ένα πρόγραμμα επεξεργασίας κειμένου, όταν εργάζεστε με αρχεία κειμένου. Όταν θέλετε να κάνετε μία ή πολύ λίγες επεξεργασίες σε ένα αρχείο κειμένου, μπορείτε απλώς να το ανοίξετε σε ένα πρόγραμμα επεξεργασίας κειμένου και να κάνετε τις αλλαγές που θέλετε. Όταν έχετε πολλές αλλαγές που πρέπει να κάνετε σε ένα αρχείο κειμένου, συχνά γράφετε ένα απλό πρόγραμμα Python. Θα εντοπίσετε την ίδια λογική, όταν εργάζεστε με βάσεις δεδομένων. Θα υλοποιείται απλές λειτουργίες στον διαχειριστή βάσης δεδομένων και πιο σύνθετες λειτουργίες θα γίνονται πιο βολικά με την Python.</p>
<h2 id="δημιουργία-πίνακα-βάσης-δεδομένων">Δημιουργία πίνακα βάσης δεδομένων</h2>
<p>Οι βάσεις δεδομένων απαιτούν πιο καθορισμένη δομή από τις λίστες ή τα λεξικά Python<a href="#fn1" class="footnote-ref" id="fnref1"><sup>1</sup></a>.</p>
<p>Όταν δημιουργούμε έναν <em>πίνακα</em> βάσης δεδομένων, πρέπει να πούμε εκ των προτέρων στη βάση δεδομένων τα ονόματα καθεμιάς από τις <em>στήλες</em> στον πίνακα και τον τύπο των δεδομένων που σκοπεύουμε να αποθηκεύσουμε σε κάθε <em>στήλη</em>. Όταν το λογισμικό της βάσης δεδομένων γνωρίζει τον τύπο των δεδομένων σε κάθε στήλη, μπορεί να επιλέξει τον πιο αποτελεσματικό τρόπο αποθήκευσης και αναζήτησης των δεδομένων, με βάση τον τύπο των δεδομένων.</p>
<p>Μπορείτε να δείτε τους διάφορους τύπους δεδομένων που υποστηρίζονται από το SQLite στην ακόλουθη διεύθυνση url:</p>
<p><a href="http://www.sqlite.org/datatypes.html" class="uri">http://www.sqlite.org/datatypes.html</a></p>
<p>Ο καθορισμός της δομής για τα δεδομένα σας εκ των προτέρων μπορεί να φαίνεται άβολος στην αρχή, αλλά το αποτέλεσμα είναι η γρήγορη πρόσβαση στα δεδομένα σας, ακόμα και όταν η βάση δεδομένων περιέχει μεγάλο όγκο δεδομένων.</p>
<p>Ο κώδικας για τη δημιουργία ενός αρχείου βάσης δεδομένων και ενός πίνακα με το όνομα <code>Tracks</code> με δύο στήλες στη βάση δεδομένων είναι ο εξής:</p>
<p> </p>
<pre class="python"><code>import sqlite3

conn = sqlite3.connect(&#39;music.sqlite&#39;)
cur = conn.cursor()

cur.execute(&#39;DROP TABLE IF EXISTS Tracks&#39;)
cur.execute(&#39;CREATE TABLE Tracks (title TEXT, plays INTEGER)&#39;)

conn.close()

# Code: http://www.gr.py4e.com/code3/db1.py</code></pre>
<p>   </p>
<p>Η λειτουργία <code>connect</code> πραγματοποιεί μια “σύνδεση” με τη βάση δεδομένων, που είναι αποθηκευμένη στο αρχείο <code>music.sqlite</code>, στον τρέχοντα κατάλογο. Εάν το αρχείο δεν υπάρχει, θα δημιουργηθεί. Ο λόγος που αυτό ονομάζεται “σύνδεση” είναι ότι μερικές φορές η βάση δεδομένων αποθηκεύεται σε έναν ξεχωριστό “διακομιστή βάσης δεδομένων”, από τον διακομιστή στον οποίο εκτελούμε την εφαρμογή μας. Στα απλά παραδείγματά μας η βάση δεδομένων θα είναι απλώς ένα τοπικό αρχείο στον ίδιο κατάλογο με τον κώδικα Python που εκτελούμε.</p>
<p>Ένας <em>κέρσορας (cursor)</em> είναι σαν ένας περιγραφέας αρχείου, που μπορούμε να χρησιμοποιήσουμε για να εκτελέσουμε λειτουργίες επί των δεδομένων, που είναι αποθηκευμένα στη βάση δεδομένων. Η κλήση του <code>cursor()</code> μοιάζει πολύ εννοιολογικά με την κλήση του <code>open()</code>, όταν πρόκειται για αρχεία κειμένου.</p>
<figure>
<img src="../images/cursor.svg" alt="Ένας Κέρσορας Βάσης Δεδομένων" style="height: 2.0in;"/>
<figcaption>
Ένας Κέρσορας Βάσης Δεδομένων
</figcaption>
</figure>
<p>Μόλις έχουμε τον κέρσορα, μπορούμε να αρχίσουμε να εκτελούμε εντολές προς τα περιεχόμενα της βάσης δεδομένων χρησιμοποιώντας τη μέθοδο <code>execute()</code>.</p>
<p>Οι εντολές βάσης δεδομένων εκφράζονται σε μια ειδική γλώσσα, που έχει τυποποιηθεί σε πολλούς διαφορετικούς προμηθευτές βάσεων δεδομένων για να μας δώσουν τη συνατότηα να μάθουμε μια ενιαία γλώσσα βάσης δεδομένων. Η γλώσσα των βάσεων δεδομένων ονομάζεται <em>Γλώσσα Δομημένων Ερωταπαντήσεων - Structured Query Language</em> ή <em>SQL</em> για συντομία.</p>
<p><a href="http://en.wikipedia.org/wiki/SQL" class="uri">http://en.wikipedia.org/wiki/SQL</a></p>
<p>Στο παράδειγμά μας, εκτελούμε δύο εντολές SQL στη βάση δεδομένων μας. Κατά σύμβαση, θα γράφουμε τις δεσμευμένες λέξεις της SQL με κεφαλαία γράμματα και τα υπόλοιπα μέρη της εντολής, που προσθέτουμε (όπως τα ονόματα του πίνακα και των στηλών) θα εμφανίζονται με πεζά.</p>
<p>Η πρώτη εντολή SQL διαγράφει τον πίνακα <code>Tracks</code> από τη βάση δεδομένων, εάν υπάρχει. Αυτό το μοτίβο χρησιμοποιείται απλώς για να μας επιτρέψει να εκτελέσουμε το ίδιο πρόγραμμα και να δημιουργήσουμε ξανά και ξανά τον πίνακα <code>Tracks</code> χωρίς να προκληθεί σφάλμα. Σημειώστε ότι η εντολή <code>DROP TABLE</code> διαγράφει τον πίνακα και όλα τα περιεχόμενά του από τη βάση δεδομένων (δηλαδή, δεν υπάρχει “αναίρεση”).</p>
<pre class="python"><code>cur.execute(&#39;DROP TABLE IF EXISTS Tracks &#39;)</code></pre>
<p>Η δεύτερη εντολή δημιουργεί έναν πίνακα με όνομα <code>Tracks</code>, με μια στήλη κειμένου, που ονομάζεται <code>title</code> και μια στήλη ακεραίων, με το όνομα <code>plays</code>.</p>
<pre class="python"><code>cur.execute(&#39;CREATE TABLE Tracks (title TEXT, plays INTEGER)&#39;)</code></pre>
<p>Τώρα που δημιουργήσαμε έναν πίνακα με το όνομα <code>Tracks</code>, μπορούμε να εισάγουμε κάποια δεδομένα σε αυτόν τον πίνακα, χρησιμοποιώντας την εντολή SQL <code>INSERT</code>. Και πάλι, ξεκινάμε κάνοντας μια σύνδεση με τη βάση δεδομένων και αποκτώντας τον <code>cursor</code>. Στη συνέχεια, μπορούμε να εκτελέσουμε εντολές SQL, χρησιμοποιώντας τον κέρσορα.</p>
<p>Η εντολή SQL <code>INSERT</code> δηλώνει ποιον πίνακα θα χρησιμοποιήσουμε και στη συνέχεια ορίζει μια νέα σειρά, παραθέτοντας τα πεδία που θέλουμε να συμπεριλάβουμε <code>(title, plays)</code>, ακολουθούμενα από το <code>VALUES</code> και τις <code>τιμές</code>, που θέλουμε να τοποθετηθούν στη νέα σειρά. Καθορίζουμε τις τιμές ως ερωτηματικά <code>(?, ?)</code>, για να υποδείξουμε ότι οι πραγματικές τιμές μεταβιβάζονται ως η πλειάδα <code>( 'My Way', 15 )</code> και μάλιστα, ως η δεύτερη παράμετρος στην κλήση της <code>execute()</code>.</p>
<pre class="python"><code>import sqlite3

conn = sqlite3.connect(&#39;music.sqlite&#39;)
cur = conn.cursor()

cur.execute(&#39;INSERT INTO Tracks (title, plays) VALUES (?, ?)&#39;,
    (&#39;Thunderstruck&#39;, 20))
cur.execute(&#39;INSERT INTO Tracks (title, plays) VALUES (?, ?)&#39;,
    (&#39;My Way&#39;, 15))
conn.commit()

print(&#39;Tracks:&#39;)
cur.execute(&#39;SELECT title, plays FROM Tracks&#39;)
for row in cur:
     print(row)

cur.execute(&#39;DELETE FROM Tracks WHERE plays &lt; 100&#39;)
conn.commit()

cur.close()

# Code: http://www.gr.py4e.com/code3/db2.py</code></pre>
<p>Πρώτα, με το <code>INSERT</code> εισαγάγουμε δύο γραμμές στον πίνακά μας και χρησιμοποιούμε την <code>commit()</code> για να αναγκάσουμε τα δεδομένα να εγγραφούν στο αρχείο της βάσης δεδομένων.</p>
<figure>
<img src="../images/tracks.svg" alt="Γραμμές σε έναν Πίνακα" style="height: 1.5in;"/>
<figcaption>
Γραμμές σε έναν Πίνακα
</figcaption>
</figure>
<p>Στη συνέχεια, χρησιμοποιούμε την εντολή <code>SELECT</code>, για να ανακτήσουμε τις γραμμές που μόλις εισαγάγαμε από τον πίνακα. Στην εντολή <code>SELECT</code>, δηλώνουμε ποιες στήλες θέλουμε <code>(title, plays)</code> και δηλώνουμε επίσης από ποιον πίνακα θέλουμε να ανακτήσουμε τα δεδομένα. Αφού εκτελέσουμε την πρόταση <code>SELECT</code>, ο κέρσορας μπορεί να χρησιμοποιηθεί στο βρόχο <code>for</code> για να διατρέξουμε τις γραμμές που ανέκτησε η <code>SELECT</code>. Για λόγους αποτελεσματικότητας, ο κέρσορας δεν διαβάζει όλα τα δεδομένα από τη βάση δεδομένων όταν εκτελούμε την εντολή <code>SELECT</code>. Αντίθετα, τα δεδομένα διαβάζονται κατ’ απαίτηση καθώς κάνουμε τις απαιτούμε μία μία, με το βρόχο<code>for</code>.</p>
<p>Η έξοδος του προγράμματος είναι η εξής:</p>
<pre class="{text}"><code>Tracks:
(&#39;Thunderstruck&#39;, 20)
(&#39;My Way&#39;, 15)</code></pre>
<p></p>
<p>Ο βρόχος <code>for</code> βρίσκει δύο γραμμές και κάθε γραμμή είναι μια πλειάδα Python με την πρώτη τιμή ως <code>title</code> και τη δεύτερη τιμή ως τον αριθμό των <code>plays</code>.</p>
<p><em>Σημείωση: Μπορεί να δείτε συμβολοσειρές που ξεκινούν με <code>u'</code> σε άλλα βιβλία ή στο Διαδίκτυο. Αυτό ήταν μια ένδειξη στην Python 2 ότι οι συγκεκριμένες συμβολοσειρές είναι συμβολοσειρές <strong>Unicode</strong>, που μπορούν να αποθηκεύουν σύνολα μη Λατινικών χαρακτήρων. Στην Python 3, όλες οι συμβολοσειρές είναι από προεπιλογή συμβολοσειρές unicode.</em></p>
<p>Στο τέλος του προγράμματος, εκτελούμε μια εντολή SQL <code>DELETE</code> για διαγραφή των γραμμών που μόλις δημιουργήσαμε, ώστε να μπορούμε να τρέχουμε ξανά και ξανά το ίδιο πρόγραμμα. Η εντολή <code>DELETE</code> χρησιμοποιεί τον όρο <code>WHERE</code>, που μας επιτρέπει να εφαρμόσουμε ένα κριτήριο επιλογής, ώστε να μπορούμε να ζητήσουμε από τη βάση δεδομένων να εφαρμόσει την εντολή μόνο στις γραμμές που ταιριάζουν με το κριτήριο. Σε αυτό το παράδειγμα το κριτήριο συμβαίνει να ισχύει για όλες τις γραμμές, έτσι αδειάζουμε τον πίνακα, ώστε να μπορούμε να τρέξουμε το πρόγραμμα επανειλημμένα. Αφού εκτελεστεί η <code>DELETE</code>, καλούμε επίσης την <code>commit()</code>, για να κατοχυρώσουμε τις αλλαγές (διαγραφές) στη βάση δεδομένων.</p>
<h2 id="σύνοψη-γλώσσας-δομημένων-ερωταπαντήσεων">Σύνοψη γλώσσας δομημένων ερωταπαντήσεων</h2>
<p>Μέχρι στιγμής, χρησιμοποιούσαμε τη γλώσσα δομημένων ερωταπαντήσεων μέσα στα παραδείγματα Python και έχουμε καλύψει πολλά από τα βασικά των εντολών SQL. Σε αυτήν την ενότητα, εξετάζουμε συγκεκριμένα τη γλώσσα SQL και δίνουμε μια επισκόπηση της σύνταξης SQL.</p>
<p>Δεδομένου ότι υπάρχουν τόσοι πολλοί διαφορετικοί προμηθευτές βάσεων δεδομένων, η γλώσσα δομημένων ερωταπαντήσεων (SQL) τυποποιήθηκε, ώστε να μπορούμε να επικοινωνούμε, με φορητό τρόπο, με συστήματα βάσεων δεδομένων από διαφορετικούς προμηθευτές.</p>
<p>Μια σχεσιακή βάση δεδομένων αποτελείται από πίνακες, γραμμές και στήλες. Οι στήλες έχουν γενικά έναν τύπο, όπως δεδομένα κειμένου, αριθμών ή ημερομηνίας. Όταν δημιουργούμε έναν πίνακα, δηλώνουμε τα ονόματα και τους τύπους των στηλών:</p>
<pre class="sql"><code>CREATE TABLE Tracks (title TEXT, plays INTEGER)</code></pre>
<p>Για να εισάγουμε μια γραμή σε έναν πίνακα, χρησιμοποιούμε την εντολή SQL <code>INSERT</code>:</p>
<pre class="sql"><code>INSERT INTO Tracks (title, plays) VALUES (&#39;My Way&#39;, 15)</code></pre>
<p>Η εντολή <code>INSERT</code> καθορίζει το όνομα του πίνακα, στη συνέχεια μια λίστα με τα πεδία/στήλες που θέλετε να καταχωρήσετε στη νέα γραμμή και, στη συνέχεια, τη δεσμευμένη λέξη <code>VALUES</code> και μια λίστα με τις αντίστοιχες τιμές, για κάθε ένα από τα πεδία αυτά.</p>
<p>Η εντολή SQL <code>SELECT</code> χρησιμοποιείται για την ανάκτηση γραμμών και στηλών από μια βάση δεδομένων. Η εντολή <code>SELECT</code> σάς επιτρέπει να καθορίσετε ποιες στήλες θέλετε να ανακτήσετε όπως επίσης, η δήλωση <code>WHERE</code> σάς επιτρέπει να επιλέξετε ποιες γραμμές θέλετε να επιστραφούν. Μπορεί επίσης να περιέχει έναν προαιρετικό όρο <code>ORDER BY</code> για την ταξινόμηση των επιστρεφόμενων γραμμών.</p>
<pre class="sql"><code>SELECT * FROM Tracks WHERE title = &#39;My Way&#39;</code></pre>
<p>Η χρήση του <code>*</code> δηλώνει ότι θέλετε η βάση δεδομένων να επιστρέψει όλες τις στήλες, για κάθε γραμμή που ταιριάζει με την πρόταση <code>WHERE</code>.</p>
<p>Σημειώστε, σε αντίθεση με την Python, σε μια πρόταση SQL <code>WHERE</code> χρησιμοποιούμε ένα μόνο σύμβολο ίσου για να υποδείξουμε μια σύγκριση ισότητας, αντί για διπλό σύμβολο ίσου. Άλλοι συγκριτικοί και λογικοί τελεστές, που επιτρέπονται, σε μια πρόταση <code>WHERE</code> περιλαμβάνουν τα <code>&lt;</code>, <code>&gt;</code>, <code>&lt;=</code>, <code>&gt;=</code>, <code>!=</code>, καθώς και τα <code>AND</code> και <code>OR</code> και παρενθέσεις για τη δημιουργία των λογικών σας εκφράσεων.</p>
<p>Μπορείτε να ζητήσετε να ταξινομηθούν οι επιστρεφόμενες γραμμές, κατά ένα από τα πεδία, ως εξής:</p>
<pre class="sql"><code>SELECT title,plays FROM Tracks ORDER BY title</code></pre>
<p>Για να διαγράψετε μια γραμμή, χρειάζεστε μια πρόταση <code>WHERE</code> σε συνδυασμό με μια εντολή SQL <code>DELETE</code>. Η πρόταση <code>WHERE</code> καθορίζει ποιες σειρές θα διαγραφούν:</p>
<pre class="sql"><code>DELETE FROM Tracks WHERE title = &#39;My Way&#39;</code></pre>
<p>Είναι δυνατό να “ενημερώσετε” μια ή περισσότερες στήλες σε μία ή περισσότερες γραμμές ενός πίνακα, χρησιμοποιώντας την εντολή SQL <code>UPDATE</code> ως εξής:</p>
<pre class="sql"><code>UPDATE Tracks SET plays = 16 WHERE title = &#39;My Way&#39;</code></pre>
<p>Η εντολή <code>UPDATE</code> καθορίζει έναν πίνακα και, στη συνέχεια, μια λίστα πεδίων και τιμών που θα αλλάξουν, μετά τη δεσμευμένη λέξη <code>SET</code> και, στη συνέχεια, μια προαιρετική πρόταση <code>WHERE</code>, για να επιλέξετε τις γραμμές που πρόκειται να ενημερωθούν. Μια μεμονωμένη δήλωση <code>UPDATE</code> ενημερώνει όλες τις γραμμές που ταιριάζουν με την πρόταση <code>WHERE</code>. Εάν δεν έχει καθοριστεί η πρόταση <code>WHERE</code>, εκτελείται “ενημέρωση” όλων των γραμμών του πίνακα.</p>
<p>Αυτές οι τέσσερις βασικές εντολές SQL (INSERT, SELECT, UPDATE και DELETE) υλοποιούν τις τέσσερις βασικές λειτουργίες, που απαιτούνται για τη δημιουργία και τη συντήρηση των δεδομένων.</p>
<h2 id="ανίχνευση-του-twitter-με-χρήση-βάσης-δεδομένων">Ανίχνευση του Twitter με χρήση βάσης δεδομένων</h2>
<p>Σε αυτή την ενότητα, θα δημιουργήσουμε ένα απλό πρόγραμμα ανίχνευσης (spidering), που θα διατρέξει λογαριασμούς του Twitter και θα δημιουργήσει μια βάση δεδομένων με αυτούς. <em>Σημείωση: Να είστε πολύ προσεκτικοί όταν εκτελείτε αυτό το πρόγραμμα. Δεν θέλετε να τραβήξετε πάρα πολλά δεδομένα ή να εκτελέσετε το πρόγραμμα για πολύ μεγάλο χρονικό διάστημα και να καταλήξετε να τερματίσετε την πρόσβασή σας στο Twitter.</em></p>
<p>Ένα από τα προβλήματα κάθε είδους προγράμματος spidering είναι ότι πρέπει να μπορεί να διακοπεί και να επανεκκινηθεί πολλές φορές και δεν θέλετε να χάσετε τα δεδομένα που έχετε ανακτήσει μέχρι τώρα. Δεν θέλετε να επανεκκινείτε και η ανάκτηση των δεδομένων να αρχίζει στην αρχή, επομένως θέλουμε να αποθηκεύουμε τα δεδομένα καθώς τα ανακτούμε, ώστε το πρόγραμμά μας να μπορεί να δημιουργεί αντίγραφα ασφαλείας και να συνεχίζει από εκεί που σταμάτησε.</p>
<p>Θα ξεκινήσουμε με την ανάκτηση των φίλων ενός ατόμου στο Twitter και της κατάστασής τους, διατρέχοντας επαναληπτικά τη λίστα των φίλων και προσθέτοντας κάθε έναν από τους φίλους σε μια βάση δεδομένων, την οποία θα προσπελάσουμε αργότερα. Αφού επεξεργαστούμε τους φίλους ενός ατόμου στο Twitter, ελέγχουμε τη βάση δεδομένων μας και ανακτούμε έναν από τους φίλους του φίλου. Το κάνουμε αυτό ξανά και ξανά, επιλέγοντας ένα άτομο που δεν έχει “επισκεφτεί”, ανακτώντας τη λίστα φίλων του και προσθέτοντας φίλους, που δεν έχουμε δει στη λίστα μας για μελλοντική επίσκεψη.</p>
<p>Παρακολουθούμε επίσης πόσες φορές έχουμε δει έναν συγκεκριμένο φίλο στη βάση δεδομένων για να σχηματίσουμε μια εικόνα της «δημοτικότητάς» του.</p>
<p>Αποθηκεύοντας τη λίστα των γνωστών λογαριασμών μας και εάν έχουμε ανακτήσει τον λογαριασμό ή όχι και πόσο δημοφιλής είναι ο λογαριασμός σε μια βάση δεδομένων, στο δίσκο του υπολογιστή, μπορούμε να σταματήσουμε και να επανεκκινήσουμε το πρόγραμμά μας όσες φορές θέλουμε.</p>
<p>Αυτό το πρόγραμμα είναι λίγο περίπλοκο. Βασίζεται στον κώδικα από την άσκηση νωρίτερα στο βιβλίο, που χρησιμοποιεί το Twitter API.</p>
<p>Εδώ είναι ο πηγαίος κώδικας για την εφαρμογή ανίχνευσης του Twitter:</p>
<pre class="python"><code>from urllib.request import urlopen
import urllib.error
import twurl
import json
import sqlite3
import ssl

TWITTER_URL = &#39;https://api.twitter.com/1.1/friends/list.json&#39;

conn = sqlite3.connect(&#39;spider.sqlite&#39;)
cur = conn.cursor()

cur.execute(&#39;&#39;&#39;
            CREATE TABLE IF NOT EXISTS Twitter
            (name TEXT, retrieved INTEGER, friends INTEGER)&#39;&#39;&#39;)

# Αγνοήστε τα σφάλματα πιστοποιητικού SSL
ctx = ssl.create_default_context()
ctx.check_hostname = False
ctx.verify_mode = ssl.CERT_NONE

while True:
    acct = input(&#39;Εισαγάγετε έναν λογαριασμό Twitter ή τερματίστε την εκτέλεση με quit: &#39;)
    if (acct == &#39;quit&#39;): break
    if (len(acct) &lt; 1):
        cur.execute(&#39;SELECT name FROM Twitter WHERE retrieved = 0 LIMIT 1&#39;)
        try:
            acct = cur.fetchone()[0]
        except:
            print(&#39;Δεν βρέθηκαν λογαριασμοί Twitter που δεν έχουν ήδη ανακτηθεί&#39;)
            continue

    url = twurl.augment(TWITTER_URL, {&#39;screen_name&#39;: acct, &#39;count&#39;: &#39;20&#39;})
    print(&#39;Ανάκτηση του&#39;, url)
    connection = urlopen(url, context=ctx)
    data = connection.read().decode()
    headers = dict(connection.getheaders())

    print(&#39;Απομένουν&#39;, headers[&#39;x-rate-limit-remaining&#39;])
    js = json.loads(data)
    # Εκσφαλμάτωση
    # print json.dumps(js, indent=4)

    cur.execute(&#39;UPDATE Twitter SET retrieved=1 WHERE name = ?&#39;, (acct, ))

    countnew = 0
    countold = 0
    for u in js[&#39;users&#39;]:
        friend = u[&#39;screen_name&#39;]
        print(friend)
        cur.execute(&#39;SELECT friends FROM Twitter WHERE name = ? LIMIT 1&#39;,
                    (friend, ))
        try:
            count = cur.fetchone()[0]
            cur.execute(&#39;UPDATE Twitter SET friends = ? WHERE name = ?&#39;,
                        (count+1, friend))
            countold = countold + 1
        except:
            cur.execute(&#39;&#39;&#39;INSERT INTO Twitter (name, retrieved, friends)
                        VALUES (?, 0, 1)&#39;&#39;&#39;, (friend, ))
            countnew = countnew + 1
    print(&#39;Νέοι λογαριασμοί =&#39;, countnew, &#39; Επισκεύθηκαν εκ νέου =&#39;, countold)
    conn.commit()

cur.close()

# Code: http://www.gr.py4e.com/code3/twspider.py</code></pre>
<p>Η βάση δεδομένων μας είναι αποθηκευμένη στο αρχείο <code>spider.sqlite</code> και έχει έναν πίνακα με όνομα <code>Twitter</code>. Κάθε γραμμή του πίνακα <code>Twitter</code> έχει μια στήλη για το όνομα του λογαριασμού, μία για το εάν έχουμε ανακτήσει τους φίλους αυτού του λογαριασμού και μια τρίτη με το πόσες φορές αυτός ο λογαριασμός έχει γίνει “φίλος”.</p>
<p>Στον κύριο βρόχο του προγράμματος, ζητάμε από τον χρήστη ένα όνομα λογαριασμού στο Twitter ή “quit” για έξοδο από το πρόγραμμα. Εάν ο χρήστης εισαγάγει έναν λογαριασμό Twitter, ανακτούμε τη λίστα φίλων και καταστάσεων (status) για αυτόν τον χρήστη και προσθέτουμε κάθε φίλο του στη βάση δεδομένων, εάν δεν βρίσκεται ήδη στη βάση δεδομένων. Εάν ο φίλος βρίσκεται ήδη στη λίστα, προσθέτουμε 1 στο πεδίο <code>friends</code> της γραμμής του, στη βάση δεδομένων.</p>
<p>Εάν ο χρήστης πατήσει enter, αναζητούμε στη βάση δεδομένων τον επόμενο λογαριασμό Twitter που δεν έχουμε ανακτήσει ακόμη, ανακτούμε τους φίλους και τα status για αυτόν τον λογαριασμό, τα προσθέτουμε στη βάση δεδομένων ή τους ενημερώνουμε και αυξάνουμε τον αριθμό των <code>friends</code> τους, εάν είναι ήδη καταχωρημένοι στη βάση δεδομένων.</p>
<p>Μόλις ανακτήσουμε τη λίστα των φίλων και των καταστάσεων, πραγματοποιούμε αναζήτηση σε όλα τα στοιχεία <code>user</code> στο επιστρεφόμενο JSON και ανακτούμε το <code>screen_name</code> για κάθε χρήστη. Στη συνέχεια, χρησιμοποιούμε τη δήλωση <code>SELECT</code> για να δούμε αν έχουμε ήδη αποθηκεύσει το συγκεκριμένο <code>screen_name</code> στη βάση δεδομένων και ανακτούμε τον αριθμό φίλων (<code>friends</code>) εάν υπάρχει η εγγραφή.</p>
<pre class="python"><code>countnew = 0
countold = 0
for u in js[&#39;users&#39;] :
    friend = u[&#39;screen_name&#39;]
    print(friend)
    cur.execute(&#39;SELECT friends FROM Twitter WHERE name = ? LIMIT 1&#39;,
        (friend, ) )
    try:
        count = cur.fetchone()[0]
        cur.execute(&#39;UPDATE Twitter SET friends = ? WHERE name = ?&#39;,
            (count+1, friend) )
        countold = countold + 1
    except:
        cur.execute(&#39;&#39;&#39;INSERT INTO Twitter (name, retrieved, friends)
            VALUES ( ?, 0, 1 )&#39;&#39;&#39;, ( friend, ) )
        countnew = countnew + 1
print(&#39;Νέοι λογαριασμοί=&#39;,countnew,&#39; Επισκεύθηκαν εκ νέου=&#39;,countold)
conn.commit()</code></pre>
<p>Μόλις ο κέρσορας εκτελέσει την πρόταση <code>SELECT</code>, πρέπει να ανακτήσουμε τις γραμμές. Θα μπορούσαμε να το κάνουμε αυτό με μια δήλωση <code>for</code>, αλλά επειδή ανακτούμε μόνο μία γραμμή (<code>LIMIT 1</code>), μπορούμε να χρησιμοποιήσουμε τη μέθοδο <code>fetchone()</code> για να ανακτήσουμε την πρώτη (και μοναδική) σειρά που είναι το αποτέλεσμα τη λειτουργία <code>SELECT</code>. Επειδή το <code>fetchone()</code> επιστρέφει τη γραμμή ως <em>πλειάδα</em> (ακόμα και αν υπάρχει μόνο ένα πεδίο), χρησιμοποιούμε την πρώτη τιμή της πλειάδας για να εκχωρήσουμε τον τρέχοντα αριθμό φίλων στη μεταβλητή <code>count</code>.</p>
<p>Εάν αυτή η ανάκτηση είναι επιτυχής, χρησιμοποιούμε την εντολή <code>UPDATE</code> της SQL με μια δήλωση <code>WHERE</code>, για να προσθέσουμε 1 στη στήλη <code>friends</code> της γραμμής που ταιριάζει με τον λογαριασμό του φίλου. Σημειώστε ότι υπάρχουν δύο σύμβολα κράτησης θέσης (δηλαδή, ερωτηματικά) στον κώδικα SQL και ότι η δεύτερη παράμετρος της <code>execute()</code> είναι μια πλειάδα δύο στοιχείων, που περιέχει τις τιμές, που πρέπει να αντικαταστήσουν στον κώδικα SQL, τα ερωτηματικά.</p>
<p>Εάν ο κώδικας στο μπλοκ <code>try</code> αποτύχει, αυτό είναι πιθανό να συμβεί αν καμία εγγραφή δεν ταιριάζει με τον όρο <code>WHERE name = ?</code> στη δήλωση SELECT. Έτσι, στο μπλοκ <code>except</code>, χρησιμοποιούμε την εντολή SQL <code>INSERT</code>, για να προσθέσουμε το <code>screen_name</code> του φίλου στον πίνακα με ένδειξη ότι δεν έχουμε ακόμη ανακτήσει το <code>screen_name</code> και ορίζουμε τον αριθμό φίλων (<code>friends</code>) σε ένα.</p>
<p>Έτσι την πρώτη φορά που τρέχει το πρόγραμμα και μπαίνουμε σε λογαριασμό Twitter, το πρόγραμμα εκτελείται ως εξής:</p>
<pre class="{text}"><code>Εισαγάγετε έναν λογαριασμό Twitter ή τερματίστε την εκτέλεση με quit: drchuck
Ανάκτηση του http://api.twitter.com/1.1/friends ...
Νέοι λογαριασμοί = 20  Επισκεύθηκαν εκ νέου = 0
Εισαγάγετε έναν λογαριασμό Twitter ή τερματίστε την εκτέλεση με quit: quit</code></pre>
<p>Επειδή είναι η πρώτη φορά που τρέχουμε το πρόγραμμα, η βάση δεδομένων δεν υπάρχει, δημιουργούμε τη βάση στο αρχείο <code>spider.sqlite</code> και προσθέτουμε έναν πίνακα με το όνομα <code>Twitter</code> στη βάση δεδομένων. Στη συνέχεια ανακτούμε μερικούς φίλους και τους προσθέτουμε όλους στη βάση δεδομένων, αφού η βάση είναι άδεια.</p>
<p>Σε αυτό το σημείο, μπορεί να θελήσουμε να γράψουμε ένα απλό πρόγραμμα για να ρίξουμε μια ματιά στο περιεχόμενο του αρχείου <code>spider.sqlite</code>:</p>
<pre class="python"><code>import sqlite3

conn = sqlite3.connect(&#39;spider.sqlite&#39;)
cur = conn.cursor()
cur.execute(&#39;SELECT * FROM Twitter&#39;)
count = 0
for row in cur:
    print(row)
    count = count + 1
print(count, &#39;γραμμές.&#39;)
cur.close()

# Code: http://www.gr.py4e.com/code3/twdump.py</code></pre>
<p>Αυτό το πρόγραμμα απλώς ανοίγει τη βάση δεδομένων και επιλέγει όλες τις στήλες, όλων των γραμμών του πίνακα <code>Twitter</code>, στη συνέχεια διατρέχει τις γραμμές και εκτυπώνει κάθε μία από αυτές.</p>
<p>Εάν εκτελέσουμε αυτό το πρόγραμμα μετά την πρώτη εκτέλεση του Twitter spider παραπάνω, η έξοδος του θα είναι η εξής:</p>
<pre class="{text}"><code>(&#39;opencontent&#39;, 0, 1)
(&#39;lhawthorn&#39;, 0, 1)
(&#39;steve_coppin&#39;, 0, 1)
(&#39;davidkocher&#39;, 0, 1)
(&#39;hrheingold&#39;, 0, 1)
...
20 γραμμές.</code></pre>
<p>Βλέπουμε μια σειρά για κάθε <code>screen_name</code>, ότι δεν έχουμε ανακτήσει τα δεδομένα για αυτό το <code>screen_name</code> (η δεύτερη τιμή της πλειάδας που αντιστοιχεί στη στήλη <code>retrieved</code> είναι 0) και όλοι στη βάση δεδομένων έχουν έναν φίλο.</p>
<p>Τώρα η βάση δεδομένων μας αντικατοπτρίζει την ανάκτηση των φίλων του πρώτου μας λογαριασμού Twitter (<em>drchuck</em>). Μπορούμε να εκτελέσουμε ξανά το πρόγραμμα και να του πούμε να ανακτήσει τους φίλους του επόμενου “μη επεξεργασμένου” λογαριασμού πατώντας απλώς enter αντί για λογαριασμό Twitter ως εξής:</p>
<pre class="{text}"><code>Εισαγάγετε έναν λογαριασμό Twitter ή τερματίστε την εκτέλεση με quit:
Ανάκτηση του http://api.twitter.com/1.1/friends ...
Νέοι λογαριασμοί = 18  Επισκεύθηκαν εκ νέου = 2
Εισαγάγετε έναν λογαριασμό Twitter ή τερματίστε την εκτέλεση με quit:
Ανάκτηση του http://api.twitter.com/1.1/friends ...
Νέοι λογαριασμοί = 17  Επισκεύθηκαν εκ νέου = 3
Εισαγάγετε έναν λογαριασμό Twitter ή τερματίστε την εκτέλεση με quit: quit</code></pre>
<p>Αφού πατήσαμε enter (δηλαδή, δεν καθορίσαμε λογαριασμό Twitter), εκτελείται ο ακόλουθος κώδικας:</p>
<pre class="python"><code>if ( len(acct) &lt; 1 ) :
    cur.execute(&#39;SELECT name FROM Twitter WHERE retrieved = 0 LIMIT 1&#39;)
    try:
        acct = cur.fetchone()[0]
    except:
        print(&#39;Δεν βρέθηκαν λογαριασμοί Twitter που δεν έχουν ήδη ανακτηθεί&#39;)
        continue</code></pre>
<p>Χρησιμοποιούμε την εντολή SQL <code>SELECT</code> για να ανακτήσουμε το όνομα του πρώτου (<code>LIMIT 1</code>) χρήστη, που εξακολουθεί να έχει μηδενική τιμή στο “έχουμε ανακτήσει αυτόν τον χρήστη”. Χρησιμοποιούμε επίσης το μοτίβο <code>fetchone()[0]</code>, σε ένα μπλοκ try/except, για να εξαγάγουμε ένα <code>screen_name</code> από τα δεδομένα που ανακτήθηκαν ή για να εμφανίσουμε ένα μήνυμα σφάλματος και να τερματίσουμε την τρέχουσα εκτέλεση του βρόχου.</p>
<p>Εάν ανακτήσαμε με επιτυχία ένα μη επεξεργασμένο <code>screen_name</code>, ανακτούμε τα δεδομένα του ως εξής:</p>
<pre class="python"><code>url=twurl.augment(TWITTER_URL,{&#39;screen_name&#39;: acct,&#39;count&#39;: &#39;20&#39;})
print(&#39;Ανάκτηση του&#39;, url)
connection = urllib.urlopen(url)
data = connection.read()
js = json.loads(data)

cur.execute(&#39;UPDATE Twitter SET retrieved=1 WHERE name = ?&#39;,(acct, ))</code></pre>
<p>Μόλις ανακτήσουμε τα δεδομένα επιτυχώς, χρησιμοποιούμε την εντολή <code>UPDATE</code> για να θέσουμε στη στήλη <code>retrieved</code> το 1, για να υποδείξουμε ότι έχουμε ολοκληρώσει την ανάκτηση των φίλων αυτού του λογαριασμού. Αυτό μας εμποδίζει από το να ανακτούμε τα ίδια δεδομένα ξανά και ξανά και μας επιτρέπει να προχωράμε στο δικτύο φίλων Twitter.</p>
<p>Εάν τρέξουμε το πρόγραμμα φίλου και πατήσουμε το enter δύο φορές για να ανακτήσουμε τους επόμενους φίλους, που δεν έχουν επισκεφτεί και μετά εκτελέσουμε το πρόγραμμα εμφάνισης (twdump.py), θα μας δώσει την ακόλουθη έξοδο:</p>
<pre class="{text}"><code>(&#39;opencontent&#39;, 1, 1)
(&#39;lhawthorn&#39;, 1, 1)
(&#39;steve_coppin&#39;, 0, 1)
(&#39;davidkocher&#39;, 0, 1)
(&#39;hrheingold&#39;, 0, 1)
...
(&#39;cnxorg&#39;, 0, 2)
(&#39;knoop&#39;, 0, 1)
(&#39;kthanos&#39;, 0, 2)
(&#39;LectureTools&#39;, 0, 1)
...
55 γραμμές.</code></pre>
<p>Μπορούμε να δούμε ότι έχουμε καταγράψει σωστά ότι έχουμε επισκεφτεί το <code>lhawthorn</code> και το <code>opencontent</code>. Επίσης οι λογαριασμοί <code>cnxorg</code> και <code>kthanos</code> έχουν ήδη δύο ακόλουθους. Εφόσον τώρα έχουμε ανακτήσει τους φίλους τριών ατόμων (<code>drchuck</code>, <code>opencontent</code> και <code>lhawthorn</code>), ο πίνακας μας έχει 52 (=55-3) γραμμές φίλων για ανάκτηση.</p>
<p>Κάθε φορά που εκτελούμε το πρόγραμμα και πατάμε enter, θα επιλέγει τον επόμενο λογαριασμό, που δεν έχει επισκεφτεί (π.χ., ο επόμενος λογαριασμός θα είναι ο <code>steve_coppin</code>), θα ανακτά τους φίλους του, θα τον επισημαίνει ως ανακτημένο και κάθε έναν από τους φίλους του <code>steve_coppin</code> είτε τον προσθέτει στο τέλος της βάσης δεδομένων είτε ενημερώνει τον αριθμό των φίλων του, εάν βρίσκονται ήδη στη βάση δεδομένων.</p>
<p>Μιας και τα δεδομένα του προγράμματος αποθηκεύονται όλα στο δίσκο, σε μια βάση δεδομένων, η δραστηριότητα spidering μπορεί να ανασταλεί και να συνεχιστεί όσες φορές θέλετε χωρίς απώλεια δεδομένων.</p>
<h2 id="στοιχειώδης-μοντελοποίηση-δεδομένων">Στοιχειώδης μοντελοποίηση δεδομένων</h2>
<p>Η πραγματική ισχύς μιας σχεσιακής βάσης δεδομένων φαίνεται όταν δημιουργούμε πολλούς πίνακες και τους συνδέουμε. Το να αποφασίσετε πώς να χωρίσετε τα δεδομένα της εφαρμογής σας σε πολλούς πίνακες και η δημιουργία των σχέσεων μεταξύ των πινάκων ονομάζεται <em>μοντελοποίηση δεδομένων</em>. Το έγγραφο με το σχεδιάγραμμα, που δείχνει τους πίνακες και τις σχέσεις μεταξύ τους, ονομάζεται <em>μοντέλο δεδομένων</em>.</p>
<p>Η μοντελοποίηση δεδομένων είναι μια σχετικά περίπλοκη διαδικασία και θα αναφερθούμε μόνο στις πιο βασικές έννοιες της μοντελοποίησης σχεσιακών δεδομένων σε αυτήν την ενότητα. Για περισσότερες λεπτομέρειες σχετικά με τη μοντελοποίηση δεδομένων, μπορείτε να ξεκινήσετε από:</p>
<p><a href="http://en.wikipedia.org/wiki/Relational_model" class="uri">http://en.wikipedia.org/wiki/Relational_model</a></p>
<p>Ας πούμε ότι στην εφαρμογή αντίχνευσης του Twitter, αντί να μετράμε απλώς τους φίλους ενός ατόμου, θέλαμε να κρατήσουμε μια λίστα με όλες τις εισερχόμενες σχέσεις, ώστε να μπορούμε να δημιουργήσουμς μια λίστα με όλους όσους ακολουθούν έναν συγκεκριμένο λογαριασμό.</p>
<p>Δεδομένου ότι όλοι θα έχουν, πιθανώς, πολλούς λογαριασμούς που τους ακολουθούν, δεν μπορούμε απλώς να προσθέσουμε μία στήλη στον πίνακα <code>Twitter</code>. Δημιουργούμε λοιπόν έναν νέο πίνακα που καταγράφει τα ζεύγη φίλων. Ο παρακάτω είναι ένας απλός τρόπος για να φτιάξετε έναν τέτοιο πίνακα:</p>
<pre class="sql"><code>CREATE TABLE Pals (from_friend TEXT, to_friend TEXT)</code></pre>
<p>Κάθε φορά που συναντάμε ένα άτομο που ακολουθεί ο <code>drchuck</code>, εισάγουμε μια γραμμή της μορφής:</p>
<pre class="sql"><code>INSERT INTO Pals (from_friend,to_friend) VALUES (&#39;drchuck&#39;, &#39;lhawthorn&#39;)</code></pre>
<p>Καθώς επεξεργαζόμαστε τους 20 φίλους από τη ροή Twitter του <code>drchuck</code>, θα εισαγάγουμε 20 εγγραφές με το “drchuck” ως πρώτη παράμετρο, οπότε θα καταλήξουμε να αντιγράφουμε την ίδια συμβολοσειρά, πολλές φορές, στη βάση δεδομένων.</p>
<p>Αυτή η αντιγραφή δεδομένων συμβολοσειράς παραβιάζει μία από τις βασικές πρακτικές της <em>κανονικοποίησης βάσων δεδομένων</em>, η οποία ουσιαστικά δηλώνει ότι δεν πρέπει, ποτέ, να αποθηκεύουμε τα ίδια δεδομένα συμβολοσειράς στη βάση δεδομένων, περισσότερες από μία φορές. Εάν χρειαζόμαστε τα δεδομένα περισσότερες από μία φορές, δημιουργούμε ένα αριθμητικό <em>κλειδί</em> για τα δεδομένα και αναφερόμαστε στα πραγματικά δεδομένα χρησιμοποιώντας αυτό το κλειδί.</p>
<p>Πρακτικά, μια συμβολοσειρά καταλαμβάνει πολύ περισσότερο χώρο από έναν ακέραιο στο δίσκο και στη μνήμη του υπολογιστή μας και απαιτείται περισσότερος χρόνος από τον επεξεργαστή για σύγκριση και ταξινόμηση. Εάν έχουμε μόνο μερικές εκατοντάδες καταχωρήσεις, ο χρόνος αποθήκευσης και επεξεργασίας δεν έχουν σημασία. Ωστόσο, εάν έχουμε ένα εκατομμύριο άτομα στη βάση δεδομένων μας και την πιθανότητα 100 εκατομμυρίων συνδέσμων φίλων, είναι σημαντικό να μπορούμε να σαρώνουμε δεδομένα όσο το δυνατόν γρηγορότερα.</p>
<p>Θα αποθηκεύσουμε τους λογαριασμούς μας στο Twitter σε έναν πίνακα με το όνομα <code>People</code>, αντί του πίνακα <code>Twitter</code>, που χρησιμοποιήθηκε στο προηγούμενο παράδειγμα. Ο πίνακας <code>People</code> έχει μια πρόσθετη στήλη, για την αποθήκευση του αριθμητικού κλειδιού που σχετίζεται με τη γραμμή αυτού του χρήστη του Twitter. Το SQLite έχει μια δυνατότητα που προσθέτει αυτόματα την τιμή κλειδιού σε κάθε γραμμή που εισάγουμε σε έναν πίνακα, χρησιμοποιώντας έναν ειδικό τύπο στήλης δεδομένων (<code>INTEGER PRIMARY KEY</code>).</p>
<p>Μπορούμε να δημιουργήσουμε τον πίνακα <code>People</code> με αυτήν την πρόσθετη στήλη <code>id</code> ως εξής:</p>
<pre class="sql"><code>CREATE TABLE People
    (id INTEGER PRIMARY KEY, name TEXT UNIQUE, retrieved INTEGER)</code></pre>
<p>Παρατηρήστε ότι δεν διατηρούμε πλέον τον αριθμό φίλων, σε κάθε γραμμή του πίνακα <code>People</code>. Όταν επιλέγουμε το <code>INTEGER PRIMARY KEY</code> ως τον τύπο της στήλης <code>id</code>, υποδεικνύουμε ότι θα θέλαμε η SQLite να διαχειρίζεται αυτή τη στήλη και να εκχωρεί αυτόματα, σε κάθε γραμμή που εισάγουμε, ένα μοναδικό αριθμητικό κλειδί. Προσθέτουμε επίσης τη δεσμευμένη λέξη <code>UNIQUE</code> για να επιβάλλουμε έναν περιορισμό, να υποδείξουμε ότι δεν θα επιτρέψουμε στην SQLite να εισάγει δύο γραμμές με την ίδια τιμή για το <code>name</code>.</p>
<p>Τώρα αντί να δημιουργήσουμε τον παραπάνω πίνακα <code>Pals</code>, δημιουργούμε έναν πίνακα που ονομάζεται <code>Follows</code>, με δύο στήλες ακεραίων, <code>from_id</code> και <code>to_id</code> και έναν περιορισμό στον πίνακα ότι ο <em>συνδυασμός</em> των <code>from_id</code> και <code>to_id</code> πρέπει να να είναι μοναδικός σε αυτόν τον πίνακα (δηλαδή, δεν μπορούμε να εισαγάγουμε διπλότυπες εγγραφές) στη βάση δεδομένων μας.</p>
<pre class="sql"><code>CREATE TABLE Follows
    (from_id INTEGER, to_id INTEGER, UNIQUE(from_id, to_id) )</code></pre>
<p>Όταν προσθέτουμε περιορισμό <code>UNIQUE</code> στους πίνακές μας, επικοινωνούμε ένα σύνολο κανόνων που ζητάμε από τη βάση δεδομένων να τους επιβάλει, όταν προσπαθούμε να εισαγάγουμε εγγραφές. Δημιουργούμε αυτούς τους περιορισμούς στα προγράμματά μας για ευκολία, όπως θα δούμε σε λίγο. Οι περιορισμοί μας εμποδίζουν από το να κάνουμε λάθη και μας διευκολύνουν να γράψουμε μέρος του κώδικά μας.</p>
<p>Στην ουσία, δημιουργώντας αυτόν τον πίνακα <code>Follows</code>, διαμορφώνουμε μια “σχέση”, όπου ένα άτομο “ακολουθεί” κάποιον άλλο και την αναπαριστάνουμε με ένα ζεύγος αριθμών που υποδεικνύουν ότι (α) τα άτομα είναι συνδεδεμένα και (β) την κατεύθυνση της σχέσης.</p>
<figure>
<img src="../images/twitter1.svg" alt="Σχέσεις Μεταξύ Πινάκων" style="height: 3.5in;"/>
<figcaption>
Σχέσεις Μεταξύ Πινάκων
</figcaption>
</figure>
<h2 id="χρήση-πολλών-πινάκων">Χρήση πολλών πινάκων</h2>
<p>Τώρα θα επαναλάβουμε το πρόγραμμα αντίχνευσης Twitter χρησιμοποιώντας δύο πίνακες, τα κύρια κλειδιά και τις αναφορές κλειδιών όπως περιγράφηκαν παραπάνω. Εδώ είναι ο κώδικας για τη νέα έκδοση του προγράμματος:</p>
<pre class="python"><code>import urllib.request, urllib.parse, urllib.error
import twurl
import json
import sqlite3
import ssl

TWITTER_URL = &#39;https://api.twitter.com/1.1/friends/list.json&#39;

conn = sqlite3.connect(&#39;friends.sqlite&#39;)
cur = conn.cursor()

cur.execute(&#39;&#39;&#39;CREATE TABLE IF NOT EXISTS People
            (id INTEGER PRIMARY KEY, name TEXT UNIQUE, retrieved INTEGER)&#39;&#39;&#39;)
cur.execute(&#39;&#39;&#39;CREATE TABLE IF NOT EXISTS Follows
            (from_id INTEGER, to_id INTEGER, UNIQUE(from_id, to_id))&#39;&#39;&#39;)

# Ignore SSL certificate errors
ctx = ssl.create_default_context()
ctx.check_hostname = False
ctx.verify_mode = ssl.CERT_NONE

while True:
    acct = input(&#39;Εισαγάγετε έναν λογαριασμό Twitter ή τερματίστε την εκτέλεση με quit: &#39;)
    if (acct == &#39;quit&#39;): break
    if (len(acct) &lt; 1):
        cur.execute(&#39;SELECT id, name FROM People WHERE retrieved=0 LIMIT 1&#39;)
        try:
            (id, acct) = cur.fetchone()
        except:
            print(&#39;Δεν βρέθηκαν λογαριασμοί Twitter που δεν έχουν ήδη ανακτηθεί&#39;)
            continue
    else:
        cur.execute(&#39;SELECT id FROM People WHERE name = ? LIMIT 1&#39;,
                    (acct, ))
        try:
            id = cur.fetchone()[0]
        except:
            cur.execute(&#39;&#39;&#39;INSERT OR IGNORE INTO People
                        (name, retrieved) VALUES (?, 0)&#39;&#39;&#39;, (acct, ))
            conn.commit()
            if cur.rowcount != 1:
                print(&#39;Σφάλμα κατά την εισαγωγή του λογαριασμού:&#39;, acct)
                continue
            id = cur.lastrowid

    url = twurl.augment(TWITTER_URL, {&#39;screen_name&#39;: acct, &#39;count&#39;: &#39;100&#39;})
    print(&#39;Ανάκτηση του&#39;, acct)
    try:
        connection = urllib.request.urlopen(url, context=ctx)
    except Exception as err:
        print(&#39;Η ανάκτηση απέτυχε &#39;, err)
        break

    data = connection.read().decode()
    headers = dict(connection.getheaders())

    print(&#39;Απομένουν&#39;, headers[&#39;x-rate-limit-remaining&#39;])

    try:
        js = json.loads(data)
    except:
        print(&#39;Δεν είναι δυνατή η ανάλυση του json&#39;)
        print(data)
        break

    # Εκσφαλμάτωση
    # print(json.dumps(js, indent=4))

    if &#39;users&#39; not in js:
        print(&#39;Λήφθηκε λάθος JSON&#39;)
        print(json.dumps(js, indent=4))
        continue

    cur.execute(&#39;UPDATE People SET retrieved=1 WHERE name = ?&#39;, (acct, ))

    countnew = 0
    countold = 0
    for u in js[&#39;users&#39;]:
        friend = u[&#39;screen_name&#39;]
        print(friend)
        cur.execute(&#39;SELECT id FROM People WHERE name = ? LIMIT 1&#39;,
                    (friend, ))
        try:
            friend_id = cur.fetchone()[0]
            countold = countold + 1
        except:
            cur.execute(&#39;&#39;&#39;INSERT OR IGNORE INTO People (name, retrieved)
                        VALUES (?, 0)&#39;&#39;&#39;, (friend, ))
            conn.commit()
            if cur.rowcount != 1:
                print(&#39;Σφάλμα κατά την εισαγωγή λογαριασμού&#39;, friend)
                continue
            friend_id = cur.lastrowid
            countnew = countnew + 1
        cur.execute(&#39;&#39;&#39;INSERT OR IGNORE INTO Follows (from_id, to_id)
                    VALUES (?, ?)&#39;&#39;&#39;, (id, friend_id))
    print(&#39;Νέοι λογαριασμοί =&#39;, countnew, &#39; Επισκεύθηκαν εκ νέου =&#39;, countold)
    print(&#39;Απομένουν&#39;, headers[&#39;x-rate-limit-remaining&#39;])
    conn.commit()
cur.close()

# Code: http://www.gr.py4e.com/code3/twfriends.py</code></pre>
<p>Αυτό το πρόγραμμα αρχίζει να γίνεται λίγο περίπλοκο, αλλά δείχνει τα μοτίβα που πρέπει να ακολουθούμε όταν χρησιμοποιούμε ακέραια κλειδιά για σύνδεση πινάκων. Τα βασικά σημεία είναι:</p>
<ol type="1">
<li><p>Δημιουργήστε πίνακες με πρωτεύοντα κλειδιά και περιορισμούς.</p></li>
<li>Όταν έχουμε ένα λογικό κλειδί για ένα άτομο (π.χ. όνομα λογαριασμού) και χρειαζόμαστε την τιμή <code>id</code> για το άτομο, ανάλογα με το αν το άτομο βρίσκεται ήδη στον πίνακα <code>People</code> ή όχι, χρειάζεται: (1) να αναζητήστε το άτομο στον πίνακα <code>People</code> και να ανακτήστε την τιμή <code>id</code> για το άτομο ή
<ol start="2" type="1">
<li>να προσθέστε το άτομο στον πίνακα <code>People</code> και να κρατήσετε την τιμή <code>id</code> της νέας σειράς που προστέθηκε.</li>
</ol></li>
<li><p>Εισαγάγετε τη γραμμή που καταγράφει τη σχέση <code>Follows</code> (“ακολουθεί”).</p></li>
</ol>
<p>Θα καλύψουμε καθένα από αυτά με τη σειρά του.</p>
<h3 id="περιορισμοί-σε-πίνακες-βάσης-δεδομένων">Περιορισμοί σε πίνακες βάσης δεδομένων</h3>
<p>Καθώς σχεδιάζουμε τις δομές των πινάκων μας, μπορούμε να πούμε στο σύστημα βάσης δεδομένων ότι θα θέλαμε να επιβάλει μερικούς περιορισμούς. Αυτοί οι περιορισμοί μας βοηθούν να αποφύγουμε λάθη και εισαγωγή εσφαλμένων δεδομένων στους πίνακές μας, όταν δημιουργούμε τους πίνακές μας:</p>
<pre class="python"><code>cur.execute(&#39;&#39;&#39;CREATE TABLE IF NOT EXISTS People
    (id INTEGER PRIMARY KEY, name TEXT UNIQUE, retrieved INTEGER)&#39;&#39;&#39;)
cur.execute(&#39;&#39;&#39;CREATE TABLE IF NOT EXISTS Follows
    (from_id INTEGER, to_id INTEGER, UNIQUE(from_id, to_id))&#39;&#39;&#39;)</code></pre>
<p>Υποδεικνύουμε ότι η στήλη <code>name</code> στον πίνακα <code>People</code> πρέπει να είναι <code>UNIQUE (ΜΟΝΑΔΙΚΗ)</code>. Υποδεικνύουμε επίσης ότι ο συνδυασμός των δύο αριθμών (<code>from_id</code> και <code>to_id</code>), σε κάθε γραμμή του πίνακα <code>Follows</code>, πρέπει να είναι μοναδικός. Αυτοί οι περιορισμοί μας εμποδίζουν να κάνουμε λάθη, όπως η προσθήκη της ίδιας σχέσης, περισσότερες από μία φορές.</p>
<p>Μπορούμε να εκμεταλλευτούμε αυτούς τους περιορισμούς στον ακόλουθο κώδικα:</p>
<pre class="python"><code>cur.execute(&#39;&#39;&#39;INSERT OR IGNORE INTO People (name, retrieved)
    VALUES ( ?, 0)&#39;&#39;&#39;, ( friend, ) )</code></pre>
<p>Προσθέτουμε τον όρο <code>OR IGNORE</code> στην εντολή <code>INSERT</code> για να υποδείξουμε ότι εάν αυτό το συγκεκριμένο <code>INSERT</code> προκαλεί παραβίαση του περιορισμού “Το <code>name</code> πρέπει να είναι μοναδικό”, το σύστημα βάσης δεδομένων επιτρέπεται να αγνοήσει το <code>INSERT</code>. Χρησιμοποιούμε τον περιορισμό της βάσης δεδομένων ως δίχτυ ασφαλείας, για να βεβαιωθούμε ότι δεν θα κάνουμε άθελά μας κάτι λάθος.</p>
<p>Ομοίως, ο ακόλουθος κώδικας διασφαλίζει ότι δεν θα προσθέσουμε την ίδια ακριβώς σχέση <code>Follows</code> δύο φορές.</p>
<pre class="python"><code>cur.execute(&#39;&#39;&#39;INSERT OR IGNORE INTO Follows
    (from_id, to_id) VALUES (?, ?)&#39;&#39;&#39;, (id, friend_id) )</code></pre>
<p>Και πάλι, απλώς λέμε στη βάση δεδομένων να αγνοήσει τo <code>INSERT (ΕΙΣΑΓΩΓΗ)</code>, εάν παραβιάζει τον περιορισμό μοναδικότητας, που καθορίσαμε για τις γραμμές του <code>Follows</code>.</p>
<h3 id="ανάκτηση-καιή-εισαγωγή-εγγραφής">Ανάκτηση και/ή εισαγωγή εγγραφής</h3>
<p>Όταν ζητάμε από τον χρήστη έναν λογαριασμό Twitter, εάν ο λογαριασμός υπάρχει, πρέπει να αναζητήσουμε την τιμή <code>id</code> του. Εάν ο λογαριασμός δεν υπάρχει ακόμα στον πίνακα <code>People</code>, πρέπει να εισαγάγουμε την εγγραφή και να λάβουμε την τιμή <code>id</code> της εισαγόμενης γραμμής.</p>
<p>Αυτό είναι ένα πολύ κοινό μοτίβο και γίνεται δύο φορές στο παραπάνω πρόγραμμα. Αυτός ο κώδικας δείχνει πώς αναζητούμε το <code>id</code>, για τον λογαριασμό ενός φίλου, όταν έχουμε εξαγάγει ένα <code>screen_name</code> από έναν κόμβο <code>user</code> στο ανακτηθέν Twitter JSON.</p>
<p>Δεδομένου ότι μετά από αρκετές εκτελέσεις, του παραπάνω κώδικα, θα είναι όλο και πιο πιθανό ο λογαριασμός να βρίσκεται ήδη στη βάση δεδομένων, πρώτα ελέγχουμε αν υπάρχει η εγγραφή στον <code>People</code>, χρησιμοποιώντας μια εντολή <code>SELECT</code>.</p>
<p>Αν όλα πάνε καλά<a href="#fn2" class="footnote-ref" id="fnref2"><sup>2</sup></a> μέσα στην ενότητα <code>try</code>, ανακτούμε την εγγραφή χρησιμοποιώντας το <code>fetchone()</code> και στη συνέχεια ανακτάμε το πρώτο (και μοναδικό) στοιχείο της πλειάδας που επιστράφηκε και το αποθηκεύουμε στο <code>friend_id</code>.</p>
<p>Εάν το <code>SELECT</code> αποτύχει, ο κώδικας <code>fetchone()[0]</code> θα αποτύχει επίσης και ο έλεγχος θα μεταφερθεί στην ενότητα <code>except</code>.</p>
<pre class="python"><code>    friend = u[&#39;screen_name&#39;]
    cur.execute(&#39;SELECT id FROM People WHERE name = ? LIMIT 1&#39;,
        (friend, ) )
    try:
        friend_id = cur.fetchone()[0]
        countold = countold + 1
    except:
        cur.execute(&#39;&#39;&#39;INSERT OR IGNORE INTO People (name, retrieved)
            VALUES ( ?, 0)&#39;&#39;&#39;, ( friend, ) )
        conn.commit()
        if cur.rowcount != 1 :
            print(&#39;Error inserting account:&#39;,friend)
            continue
        friend_id = cur.lastrowid
        countnew = countnew + 1</code></pre>
<p>Αν καταλήξουμε στον κώδικα του <code>except</code>, σημαίνει απλώς ότι η σειρά δεν βρέθηκε, επομένως πρέπει να εισαγάγουμε τη σειρά. Χρησιμοποιούμε <code>INSERT OR IGNORE</code> απλώς για να αποφύγουμε σφάλματα και στη συνέχεια καλούμε το <code>commit()</code>, για να αναγκάσουμε τη βάση δεδομένων να ενημερωθεί. Αφού ολοκληρωθεί η εγγραφή, μπορούμε να ελέγξουμε το <code>cur.rowcount</code> για να δούμε πόσες σειρές επηρεάστηκαν. Εφόσον προσπαθούμε να εισαγάγουμε μία μόνο σειρά, εάν ο αριθμός των επηρεαζόμενων σειρών είναι κάτι διαφορετικό από 1, είναι σφάλμα.</p>
<p>Εάν το <code>INSERT</code> είναι επιτυχές, μπορούμε να κοιτάξουμε το <code>cur.lastrowid</code> για να ελέγξουμε ποια τιμή έχει εκχωρήσει η βάση δεδομένων στη στήλη <code>id</code>, στη νεοδημιουργηθήσα γραμμή.</p>
<h3 id="αποθήκευση-της-σχέσης-φίλου">Αποθήκευση της σχέσης φίλου</h3>
<p>Από τη στιγμή που ξέρετε την τιμή κλειδιού, τόσο για τον χρήστη του Twitter όσο και για τον φίλο, στο JSON, είναι απλό να εισαγάγετε τους δύο αριθμούς στον πίνακα `Follows με τον ακόλουθο κώδικα:</p>
<pre class="python"><code>cur.execute(&#39;INSERT OR IGNORE INTO Follows (from_id, to_id) VALUES (?, ?)&#39;,
    (id, friend_id) )</code></pre>
<p>Σημειώστε ότι αφήνουμε τη βάση δεδομένων να φροντίσει για την αποφυγή “διπλής εισαγωγής” μιας σχέσης, δημιουργώντας τον πίνακα με έναν περιορισμό μοναδικότητας και, στη συνέχεια, προσθέτοντας <code>OR IGNORE</code> στην εντολή <code>INSERT</code>.</p>
<p>Ακολουθεί ένα δείγμα εκτέλεσης αυτού του προγράμματος:</p>
<pre class="{text}"><code>Εισαγάγετε έναν λογαριασμό Twitter ή τερματίστε την εκτέλεση με quit:
Δεν βρέθηκαν λογαριασμοί Twitter που δεν έχουν ήδη ανακτηθεί
Εισαγάγετε έναν λογαριασμό Twitter ή τερματίστε την εκτέλεση με quit: drchuck
Ανάκτηση του http://api.twitter.com/1.1/friends ...
Νέοι λογαριασμοί = 20  Επισκεύθηκαν εκ νέου = 0
Εισαγάγετε έναν λογαριασμό Twitter ή τερματίστε την εκτέλεση με quit:
Ανάκτηση του http://api.twitter.com/1.1/friends ...
Νέοι λογαριασμοί = 17  Επισκεύθηκαν εκ νέου = 3
Εισαγάγετε έναν λογαριασμό Twitter ή τερματίστε την εκτέλεση με quit:
Ανάκτηση του http://api.twitter.com/1.1/friends ...
Νέοι λογαριασμοί = 17  Επισκεύθηκαν εκ νέου = 3
Εισαγάγετε έναν λογαριασμό Twitter ή τερματίστε την εκτέλεση με quit: quit</code></pre>
<p>Ξεκινήσαμε με τον λογαριασμό <code>drchuck</code> και μετά αφήσαμε το πρόγραμμα να επιλέξει αυτόματα τους επόμενους δύο λογαριασμούς για ανάκτηση και προσθήκη στη βάση δεδομένων μας.</p>
<p>Ακολουθούν οι πρώτες λίγες σειρές στους πίνακες <code>People</code> και <code>Follows</code>, μετά την ολοκλήρωση αυτής της εκτέλεσης:</p>
<pre class="{text}"><code>People:
(1, &#39;drchuck&#39;, 1)
(2, &#39;opencontent&#39;, 1)
(3, &#39;lhawthorn&#39;, 1)
(4, &#39;steve_coppin&#39;, 0)
(5, &#39;davidkocher&#39;, 0)
55 γραμμές.
Follows:
(1, 2)
(1, 3)
(1, 4)
(1, 5)
(1, 6)
60 γραμμές.</code></pre>
<p>Μπορείτε να δείτε τα πεδία <code>id</code>, <code>name</code> και <code>visited</code> στον πίνακα <code>People</code> και βλέπετε τους αριθμούς και των δύο άκρων των σχέσεων στον πίνακα <code>Follows</code>. Στον πίνακα <code>People</code>, μπορούμε να δούμε ότι έχουμε επισκεφθεί τα τρία πρώτα άτομα και τα δεδομένα τους έχουν ανακτηθεί. Τα δεδομένα στον πίνακα <code>Follows</code> υποδεικνύουν ότι ο <code>drchuck</code> (χρήστης 1) είναι φίλος με όλα τα άτομα που εμφανίζονται στις πρώτες πέντε σειρές. Αυτό είναι λογικό, γιατί τα πρώτα δεδομένα που ανακτήσαμε και αποθηκεύσαμε ήταν οι φίλοι Twitter του <code>drchuck</code>. Εάν επρόκειτο να εκτυπώσετε περισσότερες σειρές από τον πίνακα <code>Follows</code>, θα βλέπατε και τους φίλους των χρηστών 2 και 3.</p>
<h2 id="τριών-ειδών-κλειδιά">Τριών ειδών κλειδιά</h2>
<p>Τώρα που αρχίσαμε να χτίζουμε ένα μοντέλο δεδομένων, τοποθετώντας τα δεδομένα μας σε πολλούς συνδεδεμένους πίνακες και συνδέοντας τις σειρές αυτών των πινάκων χρησιμοποιώντας <em>κλειδιά</em>, πρέπει να δούμε κάποια ορολογία γύρω από τα κλειδιά. Υπάρχουν γενικά τρία είδη κλειδιών που χρησιμοποιούνται σε ένα μοντέλο βάσης δεδομένων.</p>
<ul>
<li><p>Ένα <em>λογικό κλειδί (logical key)</em> είναι ένα κλειδί που μπορεί να χρησιμοποιηθεί στον “πραγματικό κόσμο” για την αναζήτηση μιας σειράς. Στο μοντέλο δεδομένων του παραδείγματός μας, το πεδίο <code>name</code> είναι ένα λογικό κλειδί. Είναι το όνομα με το οποίο εμφανίζεται ο χρήστης (screen name) και όντως αναζητούμε τη σειρά ενός χρήστη αρκετές φορές στο πρόγραμμα χρησιμοποιώντας το πεδίο <code>name</code>. Συχνά θα διαπιστώσετε ότι είναι λογικό να προσθέσετε έναν περιορισμό <code>UNIQUE</code> σε ένα λογικό κλειδί. Δεδομένου ότι το λογικό κλειδί είναι ο τρόπος με τον αποίο αναζητούμε μια σειρά στην πραγματική ζωή, δεν έχει νόημα να επιτρέπουμε πολλές σειρές με την ίδια τιμή στον πίνακα.</p></li>
<li><p>Ένα <em>πρωτεύον κλειδί (primary key)</em> είναι συνήθως ένας αριθμός που εκχωρείται αυτόματα από τη βάση δεδομένων. Γενικά δεν έχει νόημα εκτός προγράμματος και χρησιμοποιείται μόνο για τη σύνδεση σειρών από διαφορετικούς πίνακες, μεταξύ τους. Όταν θέλουμε να αναζητήσουμε μια σειρά σε έναν πίνακα, συνήθως η αναζήτηση της σειράς, χρησιμοποιώντας το πρωτεύον κλειδί είναι ο πιο γρήγορος τρόπος για να βρείτε τη σειρά. Δεδομένου ότι τα πρωτεύοντα κλειδιά είναι ακέραιοι αριθμοί, καταλαμβάνουν πολύ λίγο χώρο αποθήκευσης και μπορούν να συγκριθούν ή να ταξινομηθούν πολύ γρήγορα. Στο μοντέλο δεδομένων μας, το πεδίο <code>id</code> είναι ένα παράδειγμα πρωτεύοντος κλειδιού.</p></li>
<li><p>Ένα <em>ξένο κλειδί (foreign key)</em> είναι συνήθως ένας αριθμός που δείχνει το πρωτεύον κλειδί μιας συσχετισμένης σειράς σε διαφορετικό πίνακα. Ένα παράδειγμα ξένου κλειδιού στο μοντέλο δεδομένων μας είναι το <code>from_id</code>.</p></li>
</ul>
<p>Χρησιμοποιούμε μια σύμβαση ονομασίας που πάντα το όνομα πεδίου του πρωτεύοντος κλειδιού <code>id</code> και προσαρτάμε το επίθημα <code>_id</code> σε οποιοδήποτε όνομα πεδίου που είναι ξένο κλειδί.</p>
<h2 id="χρήση-join-για-ανάκτηση-δεδομένων">Χρήση JOIN για ανάκτηση δεδομένων</h2>
<p>Τώρα που έχουμε ακολουθήσει τους κανόνες κανονικοποίησης της βάσης δεδομένων και τα δεδομένα χωρίζονται σε δύο πίνακες, συνδεδεμένα μεταξύ τους χρησιμοποιώντας πρωτεύοντα και ξένα κλειδιά, πρέπει να είμαστε σε θέση να δημιουργήσουμε ένα <code>SELECT</code> που επανασυναρμολογεί τα δεδομένα στους πίνακες.</p>
<p>Η SQL χρησιμοποιεί τον όρο <code>JOIN</code> για να επανασυνδέσει αυτούς τους πίνακες. Στον όρο <code>JOIN</code> καθορίζετε τα πεδία που χρησιμοποιούνται για την επανασύνδεση των σειρών των πινάκων.</p>
<p>Το παρακάτω είναι ένα παράδειγμα <code>SELECT</code> με ρήτρα <code>JOIN</code>:</p>
<pre class="sql"><code>SELECT * FROM Follows JOIN People
    ON Follows.from_id = People.id WHERE People.id = 1</code></pre>
<p>Ο όρος <code>JOIN</code> υποδηλώνει ότι τα πεδία που επιλέγουμε διασχίζουν και τους πίνακες <code>Follows</code> και <code>People</code>. Η ρήτρα <code>ON</code> υποδεικνύει πώς θα ενωθούν οι δύο πίνακες: Πάρε τις σειρές από το <code>Follows</code> και προσθέστε τη σειρά του <code>People</code>, όπου το πεδίο <code>from_id</code> στο <code>Follows</code> είναι το ίδιο με την τιμή <code>id</code> του πίνακα <code>People</code>.</p>
<figure>
<img src="../images/join.svg" alt="Σύνδεση πινάκων με χρήση JOIN" style="height: 3.5in;"/>
<figcaption>
Σύνδεση πινάκων με χρήση JOIN
</figcaption>
</figure>
<p>Το αποτέλεσμα του JOIN είναι να δημιουργηθούν πολύ μεγάλες “meta-γραμμές” οι οποίες έχουν και τα δύο πεδία από τον <code>People</code> και τα αντίστοιχα πεδία από τον <code>Follows</code>. Όπου υπάρχουν περισσότερες από μία αντιστοιχίσεις μεταξύ του πεδίου <code>id</code> από τον <code>People</code> και του <code>from_id</code> από τον <code>Follows</code>, τότε το JOIN δημιουργεί μια meta-γραμμή για <em>κάθε ένα</em> από τα αντίστοιχα ζεύγη σειρών, αντιγράφοντας δεδομένα όπως απαιτείται.</p>
<p>Ο παρακάτω κώδικας δείχνει τα δεδομένα που θα έχουμε στη βάση δεδομένων μετά την εκτέλεση του προγράμματος πολλαπλών πινάκων Twitter spider (παραπάνω) πολλές φορές.</p>
<pre class="python"><code>import sqlite3

conn = sqlite3.connect(&#39;friends.sqlite&#39;)
cur = conn.cursor()

cur.execute(&#39;SELECT * FROM People&#39;)
count = 0
print(&#39;People:&#39;)
for row in cur:
    if count &lt; 5: print(row)
    count = count + 1
print(count, &#39;γραμμές.&#39;)

cur.execute(&#39;SELECT * FROM Follows&#39;)
count = 0
print(&#39;Follows:&#39;)
for row in cur:
    if count &lt; 5: print(row)
    count = count + 1
print(count, &#39;γραμμές.&#39;)

cur.execute(&#39;&#39;&#39;SELECT * FROM Follows JOIN People
            ON Follows.to_id = People.id
            WHERE Follows.from_id = 2&#39;&#39;&#39;)
count = 0
print(&#39;Συνδέσεις για το id=2:&#39;)
for row in cur:
    if count &lt; 5: print(row)
    count = count + 1
print(count, &#39;γραμμές.&#39;)

cur.close()

# Code: http://www.gr.py4e.com/code3/twjoin.py</code></pre>
<p>Σε αυτό το πρόγραμμα, καταργούμε πρώτα τους πίνακες <code>People</code> και <code>Follows</code> και, στη συνέχεια, απορρίπτουμε ένα υποσύνολο των δεδομένων στους πίνακες που είναι ενωμένοι μεταξύ τους.</p>
<p>Εδώ είναι η έξοδος του προγράμματος:</p>
<pre class="{text}"><code>python twjoin.py
People:
(1, &#39;drchuck&#39;, 1)
(2, &#39;opencontent&#39;, 1)
(3, &#39;lhawthorn&#39;, 1)
(4, &#39;steve_coppin&#39;, 0)
(5, &#39;davidkocher&#39;, 0)
55 γραμμές.
Follows:
(1, 2)
(1, 3)
(1, 4)
(1, 5)
(1, 6)
60 γραμμές.
Συνδέσεις για το id=2:
(2, 1, 1, &#39;drchuck&#39;, 1)
(2, 28, 28, &#39;cnxorg&#39;, 0)
(2, 30, 30, &#39;kthanos&#39;, 0)
(2, 102, 102, &#39;SomethingGirl&#39;, 0)
(2, 103, 103, &#39;ja_Pac&#39;, 0)
20 γραμμές.</code></pre>
<p>Βλέπετε τις στήλες από τους πίνακες <code>People</code> και <code>Follows</code> και το τελευταίο σύνολο σειρών είναι το αποτέλεσμα του <code>SELECT</code> με τον όρο <code>JOIN</code>.</p>
<p>Στην τελευταία επιλογή, αναζητούμε λογαριασμούς που είναι φίλοι του “opencontent” (δηλαδή, <code>People.id=2</code>).</p>
<p>Σε κάθε μία από τις “meta-γραμμές” στην τελευταία επιλογή, οι δύο πρώτες στήλες είναι από τον πίνακα <code>Follows</code> ακολουθούμενες από τις στήλες τρία έως πέντε του πίνακα <code>People</code>. Μπορείτε επίσης να δείτε ότι η δεύτερη στήλη (<code>Follows.to_id</code>) ταιριάζει με την τρίτη στήλη (<code>People.id</code>) σε κάθε μία από τις ενωμένες “meta-γραμμές”.</p>
<h2 id="περίληψη">Περίληψη</h2>
<p>Αυτό το κεφάλαιο έχει καλύψει πολλά, για να σας δώσει μια επισκόπηση των βασικών στοιχείων της χρήσης μιας βάσης δεδομένων στην Python. Είναι πιο περίπλοκο να γράψετε τον κώδικα για να χρησιμοποιήσετε μια βάση δεδομένων για την αποθήκευση δεδομένων, από τα λεξικά Python ή τα επίπεδα αρχεία, επομένως δεν υπάρχει λόγος να χρησιμοποιήσετε μια βάση δεδομένων, εκτός εάν η εφαρμογή σας χρειάζεται πραγματικά τις δυνατότητες μιας βάσης δεδομένων. Οι περιπτώσεις όπου μια βάση δεδομένων μπορεί να είναι αρκετά χρήσιμη είναι: (1) όταν η εφαρμογή σας χρειάζεται να κάνει πολλές μικρές τυχαίες ενημερώσεις μέσα σε ένα μεγάλο σύνολο δεδομένων, (2) όταν τα δεδομένα σας είναι τόσο μεγάλα που δεν χωρούν σε ένα λεξικό και πρέπει να αναζητήσετε πληροφορίες επαναληπτικά ή (3) όταν έχετε μια χρονοβόρα διαδικασία, που θέλετε να μπορείτε να σταματήσετε και να επανεκκινήσετε, και να διατηρήσετε τα δεδομένα από τη μια εκτέλεση στην άλλη.</p>
<p>Μπορείτε να δημιουργήσετε μια απλή βάση δεδομένων με έναν μόνο πίνακα για να ταιριάζει σε πολλές ανάγκες εφαρμογών, αλλά τα περισσότερα προβλήματα απαιτούν πολλούς πίνακες και συνδέσμους/σχέσεις μεταξύ σειρών σε διαφορετικούς πίνακες. Όταν ξεκινάτε να δημιουργείτε σχέσεις μεταξύ πινάκων, είναι σημαντικό να τις σχεδιάσετε προσεκτικά και να ακολουθήσετε τους κανόνες κανονικοποίησης της βάσης δεδομένων, για να αξιοποιήσετε με τον καλύτερο τρόπο τις δυνατότητες της βάσης δεδομένων. Δεδομένου ότι το κύριο κίνητρο για τη χρήση μιας βάσης δεδομένων είναι ότι έχετε μεγάλο όγκο δεδομένων για επεξεργασία, είναι σημαντικό να μοντελοποιήσετε τα δεδομένα σας αποτελεσματικά, ώστε τα προγράμματά σας να εκτελούνται όσο το δυνατόν γρηγορότερα.</p>
<h2 id="εκσφαλμάτωση">Εκσφαλμάτωση</h2>
<p>Ένα κοινό μοτίβο, όταν αναπτύσσετε ένα πρόγραμμα Python για να συνδεθείτε σε μια βάση δεδομένων SQLite, θα είναι η εκτέλεση ενός προγράμματος Python και ο έλεγχος των αποτελεσμάτων χρησιμοποιώντας το πρόγραμμα περιήγησης βάσης δεδομένων για SQLite (Database Browser for SQLite). Το πρόγραμμα περιήγησης σάς επιτρέπει να ελέγχετε γρήγορα εάν το πρόγραμμά σας λειτουργεί σωστά.</p>
<p>Πρέπει να είστε προσεκτικοί γιατί το SQLite φροντίζει να εμποδίζει την αλλαγή των ίδιων δεδομένων από δύο προγράμματα ταυτόχρονα. Για παράδειγμα, εάν ανοίξετε μια βάση δεδομένων στο πρόγραμμα περιήγησης και κάνετε μια αλλαγή στη βάση δεδομένων και δεν έχετε πατήσει ακόμη το κουμπί “αποθήκευση” στο πρόγραμμα περιήγησης, το πρόγραμμα περιήγησης “κλειδώνει” το αρχείο βάσης δεδομένων και εμποδίζει οποιοδήποτε άλλο πρόγραμμα να έχει πρόσβαση στο αρχείο. Συγκεκριμένα, το πρόγραμμα Python σας δεν θα μπορεί να έχει πρόσβαση στο αρχείο εάν είναι κλειδωμένο.</p>
<p>Επομένως, μια λύση είναι να βεβαιωθείτε ότι είτε κλείσατε το πρόγραμμα περιήγησης της βάσης δεδομένων είτε χρησιμοποιήσετε το μενού <em>Αρχείο</em> για να κλείσετε τη βάση δεδομένων στο πρόγραμμα περιήγησης πριν επιχειρήσετε να αποκτήσετε πρόσβαση στη βάση δεδομένων από την Python, για να αποφύγετε το πρόβλημα της αποτυχίας του κώδικα Python, επειδή η βάση δεδομένων είναι κλειδωμένη.</p>
<h2 id="γλωσσάριο">Γλωσσάριο</h2>
<dl>
<dt>ευρετήριο</dt>
<dd>Πρόσθετα δεδομένα, που το λογισμικό της βάσης δεδομένων διατηρεί ως γραμμές και τα εισάγει σε έναν πίνακα για να πραγματοποιεί τις αναζητήσεις πιο γρήγορα.
</dd>
<dt>κανονικοποίηση</dt>
<dd>Σχεδιασμός ενός μοντέλου δεδομένων έτσι ώστε να μην γίνεται αναπαραγωγή δεδομένων. Αποθηκεύουμε κάθε στοιχείο δεδομένων σε ένα σημείο της βάσης δεδομένων και το αναφέρουμε αλλού χρησιμοποιώντας ένα ξένο κλειδί.
</dd>
<dt>κέρσορας</dt>
<dd>Ένας κέρσορας σάς επιτρέπει να εκτελείτε εντολές SQL σε μια βάση δεδομένων και να ανακτάτε δεδομένα από τη βάση δεδομένων. Ο κέρσορας είναι παρόμοιος με μια υποδοχή ή έναν περιγραφέα αρχείου για συνδέσεις δικτύου και αρχεία, αντίστοιχα.
</dd>
<dt>λογικό κλειδί</dt>
<dd>Ένα κλειδί που χρησιμοποιεί ο “έξω κόσμος” για να αναζητήσει μια συγκεκριμένη σειρά. Για παράδειγμα, σε έναν πίνακα λογαριασμών χρηστών, η διεύθυνση email ενός ατόμου μπορεί να είναι καλός υποψήφιος ως λογικό κλειδί για τα δεδομένα του χρήστη.
</dd>
<dt>ξένο κλειδί - foreign key</dt>
<dd>Ένα αριθμητικό κλειδί που δείχνει το πρωτεύον κλειδί μιας γραμμής ενός άλλου πίνακα. Τα ξένα κλειδιά δημιουργούν σχέσεις μεταξύ γραμμών, που είναι αποθηκευμένες σε διαφορετικούς πίνακες.
</dd>
<dt>περιορισμός</dt>
<dd>Όταν λέμε στη βάση δεδομένων να επιβάλει έναν περιορισμός σε ένα πεδίο ή μια γραμμή ενός πίνακα. Ένας κοινός περιορισμός είναι να επιμείνουμε ότι δεν μπορούν να υπάρχουν διπλότυπες τιμές σε ένα συγκεκριμένο πεδίο (δηλαδή, όλες οι τιμές πρέπει να είναι μοναδικές).
</dd>
<dt>πλειάδα</dt>
<dd>Μια μεμονωμένη καταχώρηση σε έναν πίνακα βάσης δεδομένων, που είναι ένα σύνολο χαρακτηριστικών. Συνήθως αναφέρεται ως “γραμμή”.
</dd>
<dt>πρόγραμμα περιήγησης βάσης δεδομένων</dt>
<dd>Ένα κομμάτι λογισμικού που σας επιτρέπει να συνδεθείτε απευθείας σε μια βάση δεδομένων και να χειριστείτε τη βάση δεδομένων απευθείας χωρίς να γράψετε πρόγραμμα.
</dd>
<dt>πρωτεύων κλειδί</dt>
<dd>Ένα αριθμητικό κλειδί, που εκχωρείται σε κάθε γραμμή και χρησιμοποιείται για να αναφερθούμε σε μια γραμμή ενός πίνακα από έναν άλλο πίνακα. Συχνά η βάση δεδομένων ρυθμίζεται ώστε να εκχωρεί αυτόματα πρωτεύοντα κλειδιά, καθώς εισάγονται γραμμές.
</dd>
<dt>σχέση</dt>
<dd>Μια περιοχή μέσα σε μια βάση δεδομένων που περιέχει πλειάδες και χαρακτηριστικά. Συνήθως ονομάζεται “πίνακας”.
</dd>
<dt>χαρακτηριστικό</dt>
<dd>Μία από τις τιμές μέσα σε μια πλειάδα. Συνήθως ονομάζεται “στήλη” ή “πεδίο”.
</dd>
</dl>
<section class="footnotes">
<hr />
<ol>
<li id="fn1"><p>Το SQLite στην πραγματικότητα επιτρέπει κάποια ευελιξία στον τύπο των δεδομένων που αποθηκεύονται σε μια στήλη, αλλά θα διατηρήσουμε τους τύπους δεδομένων μας αυστηρούς σε αυτό το κεφάλαιο, ώστε οι έννοιες να ισχύουν εξίσου και σε άλλα συστήματα βάσεων δεδομένων, όπως π.χ. MySQL.<a href="#fnref1" class="footnote-back">↩</a></p></li>
<li id="fn2"><p>Γενικά, όταν μια πρόταση ξεκινά με “αν όλα πάνε καλά” θα διαπιστώσετε ότι ο κώδικας πρέπει να χρησιμοποιεί το try/except.<a href="#fnref2" class="footnote-back">↩</a></p></li>
</ol>
</section>
</body>
</html>
<?php if ( file_exists("../bookfoot.php") ) {
  $HTML_FILE = basename(__FILE__);
  $HTML = ob_get_contents();
  ob_end_clean();
  require_once "../bookfoot.php";
}?>
